[
{"url": "https://www.osradar.com/how-to-install-wkhtmltopdf-and-wkhtmltoimage-on-ubuntu-19-04-debian-10/", "title": "How To Install wkhtmltopdf and wkhtmltoimage on Ubuntu 19.04 / Debian 10", "paragraph": "Today we are going to learn that how we can convert our web pages from html format to pdf or image format. For obtaining these results we’ll use the most famous command line tools wkhtmltopdf & wkhtmltoimage. They are Open Source Command line tools used for conversion processes from html to pdf and image respectively.They both use the QT WebKit rendering engine to perform the actions.By default, the versions available on Ubuntu are old for these tools. So, we have to Install them manually. Follow the guide to get started that how we can Install wkhtmltopdf & wkhtmltoimage on Ubuntu 19.04 Linux. First of all we’ll download the tools from .deb package. Further these tools do not require a display so they are entirely headless."},
{"url": "https://www.osradar.com/how-to-install-percona-centos-8/", "title": "How to install Percona on CentOS 8?", "paragraph": "Database management is an essential part of any application. And there are many solutions but some are more business-oriented than others, and today I will show you how to install Percona on CentOS 8. With Percona you will have a professional SQL database manager 100% compatible with MySQL."},
{"url": "https://www.osradar.com/how-to-install-rstudio-ubuntu-20-04-18-04/", "title": "How to install RStudio on Ubuntu 20.04 / 18.04", "paragraph": "No matter how complete and robust a programming language is, the programmer will always need a tool to write the code. These programs have to be complete and with features that can speed up the coding process. We usually call these programs IDE. There are IDEs that support many languages making them a Swiss army knife but there are others that are more specialized. So in this post, I will show you how to install RStudio on Ubuntu 20.04 / 18.04. It is almost impossible to write R code without using RStudio."},
{"url": "https://www.osradar.com/how-to-install-openshot-video-editor-on-linux/", "title": "How to Install OpenShot Video Editor on Linux", "paragraph": "Linux is one of the most powerful OS in the world. However, because it’s not so popular and has complex system configuration, there are not so much software available on the platform. If you’re a Linux user, you already understand that. Although there are many powerful tools to perform everyday tasks, a video editor may be a good example. The most popular ones like Adobe Premiere, Final Cut Pro or Sony Vegas aren’t available as a native program on Linux, but that doesn’t mean that there’s no industry-standard editing tool."},
{"url": "https://www.osradar.com/how-to-install-php-in-windows-10/", "title": "How to install PHP in Windows 10", "paragraph": "Hi, how are you? Today I’m going to talk to you about PHP.  It is a general-purpose server-side code and interpreted programming language,  also is suitable for web development and can be embedded in HTML. Additionally, PHP has multiple ways of being used, since it can be used with scripts, in a structured way or programming in objects. Likewise, it is mainly used to create web pages, to create dynamic content and to work with databases and HTML. On the other hand, it supports most databases: MySQL, PostgreSQL, SQL Server, MongoDB. Because of these features, millions of web pages use PHP. Therefore, let’s see how to install PHP in Windows 10."},
{"url": "https://www.osradar.com/how-to-install-opencv-on-ubuntu-20-04/", "title": "How To Install OpenCV on Ubuntu 20.04", "paragraph": "OpenCV is an open source, highly optimized computer library mainly used in applications for image processing. It has variety of inbuilt images processing functions helping you to get started easily. You can read the documentation to handle OpenCV in more easy way. Here I’ll list the main & important modules in the project."},
{"url": "https://www.osradar.com/how-to-setup-wireguard-vpn-with-ubuntu-20-04/", "title": "How to setup WireGuard VPN with ubuntu 20.04", "paragraph": "Here, we will learn today how to configure WireGuard VPN with Ubuntu 20.04. Wireguard® is an amazingly straightforward yet quick and present-day VPN that uses cutting edge cryptography. It expects to be quicker and more straightforward. It means to be significantly more performant than OpenVPN. At first, was released for the Linux part, WireGuard VPN is currently cross-stage (Windows, macOS, BSD, iOS, Android) and broadly deployable."},
{"url": "https://www.osradar.com/how-to-register-and-override-dll-files-in-windows-10/", "title": "How to register and override DLL files in Windows 10", "paragraph": "Windows 10 is a system of enormous complexity. Therefore, it requires many components to work well. One of these components is the DLL libraries. Indeed, these files are essential for the proper functioning of installed apps. They even include elements such as commands, graphics, and fonts. However, mistakes can happen. Because when installing a program, the DLL files are not registered correctly. Or during the update, the link between it and the program is broken. Therefore, today we will see how to solve it. See how to register and override DLL files in Windows 10."},
{"url": "https://www.osradar.com/install-clamav-debian-ubuntu/", "title": "Install ClamAV on Debian 10 / Debian 9/ Ubuntu 20.04/ 18.04", "paragraph": "Are there viruses in Linux? The answer is yes, the point is that Linux is a very secure system that minimizes risks. However, when you use a Linux server on a network where there are many clients using Windows, it is useful to install ClamAV to remove those viruses."},
{"url": "https://www.osradar.com/how-to-instll-and-configure-nfs-client-on-ubuntu-18-04/", "title": "How To Install and Configure NFS Client on Ubuntu 18.04", "paragraph": "In previous tutorial we’ve cover the installation of NFS Server on Ubuntu. In this tutorial, you’ll cover only the configuration of NFS Client on Ubuntu 18.04. So, we already cover the introduction in the previous guide. Let’s start with some basic points."},
{"url": "https://www.osradar.com/how-to-install-the-lastest-otrs-on-ubuntu-18-04/", "title": "How to install the lastest OTRS on Ubuntu 18.04?", "paragraph": "OTRS (Open-Source Ticket Request System) is a free system that any institution can use to assign unique identifiers called tickets to service or information requests. Very useful in IT support departments to control and respond to requests made by users within an organization."},
{"url": "https://www.osradar.com/how-to-view-fps-in-android-without-root/", "title": "How to view FPS in Android without Root", "paragraph": "Hello folks, every time we play games on our Android, we want to have the best experience, to ensure that our games run as smoothly as possible we must verify the rate of frames per second. In this post, we will show you how to view the FPS without Root. The first thing you must note is that the FPS is limited by the refresh rate of your device screen. Most phones on the market have 60hz screens which are capable of displaying 60 frames per second. From 30 FPS you will have a better and more fluid experience. The most current devices have 90hz and 120hz screens. Although their screens are capable of displaying those frames per second, it depends on the power of the phone."},
{"url": "https://www.osradar.com/how-to-make-the-best-3d-letters-on-android-or-ios/", "title": "How to make the best 3D letters on Android or IOS", "paragraph": "Greetings my dear friends, today we bring you a simple guide to make the best 3D letters from your mobile device. These letters can be used to create banners for your social networks or website, also to use them in your Youtube thumbnails. A really useful trick that you should learn now. PixelLab is an app that is available for both Android and IOS. It has a simple interface easy to use. In addition to different tools that you can take advantage of to get good results. Some of its features are, text editing, 3D text, Text effects: make text stand out with dozens of text effects such as Shadow, Inner Shadow, Stroke, Background, Reflection, Emboss, Mask. In this post, we will show you how to make the best 3D letters on Android or IOS."},
{"url": "https://www.osradar.com/how-to-make-a-backup-on-linux-with-luckybackup/", "title": "How to make a backup on Linux with LuckyBackup?", "paragraph": "Linux is a fairly stable system and many people who use it attest to that. However, as with any system, it is possible that it may fail and we may have to reinstall. In this case, the main damaged the stored information. To avoid this, it is recommended that periodically, back up the system, so that if required, we have everything safe. So, today you will learn how to make a backup on Linux. For it, we will use LuckyBackup."},
{"url": "https://www.osradar.com/how-to-update-to-miui-13-on-your-xiaomi-redmi-and-poco-phone/", "title": "How to update to MIUI 13 on your Xiaomi, Redmi, and POCO phone", "paragraph": "Hello friends! MIUI 13 is finally here, it comes with Android 12. It is coming to most devices, in its global version. The mobile operating system based on Android from Xiaomi comes loaded with new features and performance improvements. Although the deployment has already reached most devices, there are still a few missing to receive the update by OTA (Over the air). It is possible to perform this update manually and in a fairly simple way. It is also possible that the update is not yet available for the region of your device. And because of this, there may be some delay. Therefore, in this post, we will show you how to update your Xiaomi, Redmi, and POCO phones to MIUI 13."},
{"url": "https://www.osradar.com/install-eclipse-on-arch-linux/", "title": "Install Eclipse on Arch Linux", "paragraph": "For developers, having the suitable IDE is extremely necessary for the maximum output. In fact, a good IDE can dramatically reduce the strain on a programmer with various helping tools at disposal."},
{"url": "https://www.osradar.com/install-libreoffice-6-4-ubuntu-linux-mint/", "title": "How to install LibreOffice 6.4 on Ubuntu 18.04 / Linux Mint 19?", "paragraph": "LibreOffice has just released its latest version. And it promises to be a whole new performance experience. In this post, we will show you how to install LibreOffice 6.4 on Ubuntu 18.04 / Linux Mint 19."},
{"url": "https://www.osradar.com/install-mlocate-in-freebsd/", "title": "Install  mlocate in FreeBSD", "paragraph": "if you came from Linux word then  is mlocate  is very  familiar for you , is one of the best ways to find files and Folders,  in Linux  the the package called  mlocate  and is  you can install via Linux package management "},
{"url": "https://www.osradar.com/install-mattermost-ubuntu/", "title": "Install Mattermost on Ubuntu 20.04 (With MariaDB)", "paragraph": "Hello, friends in this post you will learn how to install Mattermost on Ubuntu 20.04. These steps I’m going to describe are easy to follow and you should have no problems to achieve the installation."},
{"url": "https://www.osradar.com/install-apache-solr-7-5-on-centos-rhel-7-fedora-28-29/", "title": "Install Apache Solr 7.5 on CentOS/RHEL 7, Fedora 28-29", "paragraph": "Apache Solr is a standalone enterprise search server with a REST-like API. its an opensource search platform written on Java You put documents in it (called “indexing”) via JSON, XML, CSV or binary over HTTP. You query it via HTTP GET and receive JSON, XML, CSV or binary results."},
{"url": "https://www.osradar.com/install-suitecrm-ubuntu-20-04/", "title": "How to install SuiteCRM on Ubuntu 20.04?", "paragraph": "SuiteCRM is an application that loads the sales, markets, and services administration of a company. It also helps to organize all the processes concerning these activities translating this into process improvements and time-saving."},
{"url": "https://www.osradar.com/install-zabbix-opensuse-15-1-leap/", "title": "How to install Zabbix on OpenSUSE 15.1 Leap?", "paragraph": "There are too many features that make Zabbix a necessary tool in a network because with it the sysadmin can have detailed information about what happens in it. In addition, you can have real-time monitoring with their due reports."},
{"url": "https://www.osradar.com/install-wing-python-ide-ubuntu/", "title": "Install Wing Python IDE on Ubuntu 20.04 /18.04", "paragraph": "Python is one of the most popular programming languages out there. In fact, many universities already use it as an introductory language in the retirement of the old Pascal or C++. This has made many users already know firsthand the potential of the language that is very broad. The main reason to affirm this is that Python can be used in many parts as the main language or as a composite. However, to be more productive with the language requires an IDE at the height. For Java, we already have free solutions like Eclipse and Netbeans but in this post, I will show you Install Wing Python IDE on Ubuntu 20.04 /18.04."},
{"url": "https://www.osradar.com/reset-windows-10-password/", "title": "How to Reset Windows 10 Password", "paragraph": "Forgetting passwords is nothing new, but happens with most us a lot of time. If you forget your computer’s password which is running on Windows 10, don’t panic! This tutorial will help you to reset Windows 10 password in several ways. Some of the methods may seem technical, but you will reset the password and make your Windows 10 computer usable again by following the steps."},
{"url": "https://www.osradar.com/ninite-a-tool-to-automatically-install-programs-in-windows-10/", "title": "Ninite, a tool to automatically install programs in Windows 10.", "paragraph": "Hello, how are you? Every time we format our computer or when we release one. Then we have the task of downloading the programs we need to work. This is tedious work but necessary to be able to work comfortably. Additionally, it requires time and dedication on the part of the user. However, there is a way to install all these programs automatically. With a few mouse clicks, we will be able to automate the process. So here’s how to install programs automatically in Windows 10. "},
{"url": "https://www.osradar.com/step-by-step-installation-of-microsoft-exchange-server-2019/", "title": "Step By Step Installation Exchange Server 2019", "paragraph": "Exchange Server 2019 requires Windows Server 2019. Exchange Server 2019 brings a new set of technologies, features, and services to Exchange Server, the messaging platform that provides email, scheduling, and tools for custom collaboration and messaging service applications. Its goal is to support people and organizations as their work habits evolve from a communication focus to a collaboration focus. At the same time, Exchange 2019 helps lower the total cost of ownership.  whether you deploy Exchange 2019 on-premises or provision your mailboxes in the cloud."},
{"url": "https://www.osradar.com/yum-the-centos-package-manager-a-little-guide-to-use-it/", "title": "YUM the CentOS package manager: A little guide to use it", "paragraph": "The package manager is one of the essential components of the system. With them, we can install packages that often contain the applications we need for daily work. It is practically impossible to conceive of an operating system without a package manager. So, obviously, CentOS 7 has one. In this article, ideal for novices, we will teach you how to use YUM the CentOS 7 package manager. So, this way you will be able to take full advantage of this utility."},
{"url": "https://www.osradar.com/wide-launcher-enhance-your-home-screen/", "title": "Wide Launcher: Enhance your home screen", "paragraph": "Greetings friends, in this opportunity we bring you a new Launcher, so you can take full advantage of your device. Remember that Launchers are this type of apps that has the task of launching all the apps installed on your devices. One of the benefits of the Android mobile operating system is that it has a great variety of Launchers available. In this post, we will show you how to enhance your home screen."},
{"url": "https://www.osradar.com/5-windows-pe-rescue-environments-for-repair-and-maintenance/", "title": "5 Windows PE rescue environments for repair and maintenance", "paragraph": "Hello! Windows PE or Windows Preinstallation Environment is a light version of Windows with a specific function. Indeed, Microsoft implements this version to help install, deploy, deploy, repair and maintain in the best conditions of use the complete editions of desktop Windows. Additionally, it also works for Windows Server. Let me clarify that Windows PE is a fully functional and operational version. However, it cannot be used as a day-to-day client system. In fact, to avoid such uses, Windows PE automatically stops shell execution and restarts after 72 hours of continuous use. Additionally, this period cannot be extended or customized. So without further ado, let’s see 5 Windows PE rescue environments for repair and maintenance."},
{"url": "https://www.osradar.com/install-rust-opensuse/", "title": "How to install Rust Programming Language on OpenSUSE 15.2?", "paragraph": "Learning programming languages is a good option to find a good job. Above all, if you dedicate yourself to this. Because for no one is a secret that we live in times where many applications are used. That’s why this post will teach you how to install Rust on OpenSUSE 15.2"},
{"url": "https://www.osradar.com/best-pinball-games-for-windows-10/", "title": "Best Pinball Games for Windows 10", "paragraph": "Games are always an inseparable part of our computers, right? We always love to play our favorite games like Spider Solitaire or Hearts to either pass leisure times or relax a bit. to either pass leisure times or relax a bit. Speaking of games, pinball is possibly the easiest and one of the most popular ones for Windows users. The debut of pinball was first introduced with Windows XP. However, we didn’t have the awesome game built-in with the next generations of Windows. Thankfully, Windows 10 comes up with a rich app store that contains lots of small and awesome games for playing."},
{"url": "https://www.osradar.com/install-rust-programming-language-ubuntu-debian/", "title": "How to install Rust Programming language on Ubuntu 20.04 / Debian 10?", "paragraph": "Learning programming languages is a good option to find a good job. Above all, if you dedicate yourself to this. Because for no one is a secret that we live in times where many applications are used. That’s why this post will teach you how to install Rust on Ubuntu 20.04 / Debian 10."},
{"url": "https://www.osradar.com/organize-your-library-by-installing-koha-on-debian-10/", "title": "Organize your library by installing Koha on Debian 10", "paragraph": "There is much open-source software and all of them are quite useful in our work. In this post, you will learn how to install Koha on Debian 10 and manage a library easily."},
{"url": "https://www.osradar.com/how-to-delete-dll-files-in-windows-10/", "title": "How to delete DLL files in Windows 10", "paragraph": "Hello! How are you? A DLL file is an essential part of many applications developed for Windows. In fact, inside a DLL there is an executable code that allows a software to work properly. However, removing certain DLL can have disastrous results. That’s why it is necessary to know that the files to be deleted are not essential. Otherwise, the operating system could stop working. It could even come to a complete standstill. On the other hand, removing DLL that are no longer used can be beneficial to the performance and health of your computer. Since they are usually residues of already deleted programs. For that reason, today we will see how to delete DLL files in Windows 10."},
{"url": "https://www.osradar.com/how-to-change-the-default-boot-system-in-windows-10/", "title": "How to change the default boot system in Windows 10.", "paragraph": "You may find the title of this post confusing. In fact, if you have only one operating system installed, then this is not for you! However, sometimes some users have more than one version of Windows installed on their computer. Or even GNU/Linux or macOS versions. Well, in those cases it is advisable to have multiboot properly configured. That is to say, a boot manager that allows choosing the system with which we want to start. Well, in this post we will see how to change the default boot system in Windows 10."},
{"url": "https://www.osradar.com/category/tutorials/", "title": "Tutorials", "paragraph": ""},
{"url": "https://www.osradar.com/how-and-why-you-should-enable-hyper-v-in-windows-11/", "title": "How and why you should enable Hyper-V in Windows 11", "paragraph": "Hello! Have you heard about virtual machines? Do you know what virtualization is? Did you know that Windows 11 has its own virtualization approach already included? Well, we will try to answer those questions in this post. Just so we understand, Hyper-V is Microsoft’s internal virtualization solution for Windows 11. Thanks to this tool, we will be able to create virtual machines and run them on virtual hardware. It was first introduced in Windows Server 2008. In fact, the definitive version was released in June of the same year. With the launch of Windows 8 it reached all users. We also saw it in later versions such as Windows 8.1, Windows 10 or Windows 11. Let us see how we can take advantage of it and how we can enable Hyper-V. In addition to how to create virtual machines without using third-party tools."},
{"url": "https://www.osradar.com/how-to-activate-pocket-mode-on-your-android-phone/", "title": "How to activate Pocket Mode on your Android phone", "paragraph": "Greetings friends! This time we will tell you about Pocket Mode. An add-on that can help you avoid making accidental calls when you are not using your cell phone. Surely you have seen that many manufacturers have a Pocket Mode option on the latest Android phones. In this post, we are going to show you how to activate pocket mode on your Android phone. Because, although it may not seem like it can be one of the most important features of Android, besides being quite useful. This option is present in custom versions of Android from many manufacturers. Also in the stock version of Android, it is most likely available on most mobile devices. With Pocket Mode, you will avoid accidental calls to other people and other misunderstandings that arise when you unintentionally touch the screen."},
{"url": "https://www.osradar.com/how-to-download-songs-from-spotify-for-free/", "title": "How to download songs from Spotify for free", "paragraph": "Hi! The way we listen to music has changed over the years. Some time ago, with the physical format such as vinyl, cassette, or CD. However, everything has evolved to the possibility of listening to it in a file, or via streaming. On the other hand, if you were a Spotify user, surely at some point you will have missed the possibility to download the songs. Therefore, we can play them on any device we want. Certainly, Spotify is one of the most popular platforms, with more than 50 million songs available for both computers and cell phones. In addition, the service has a free version that allows us to listen to music randomly, in exchange for listening to ads every certain period of time. Today, we will learn how to download songs from Spotify free."},
{"url": "https://www.osradar.com/how-to-download-your-photos-from-xiaomi-cloud-before-it-closes/", "title": "How to download your photos from Xiaomi Cloud before it closes", "paragraph": "Greetings friends! Xiaomi plans to discontinue its Xiaomi Cloud services for your gallery items. Last year Xiaomi released a statement with the shocking news. Now we come to remind you about the closure of Xiaomi Cloud because there are only a few days left before the discontinuation of this service. So you’d better get ready and transfer all gallery items from Xiaomi Cloud to your device. In this post, we will show you how to download your photos from Xiaomi Cloud before it closes."},
{"url": "https://www.osradar.com/best-file-systems-for-keeping-ssd-healthy/", "title": "Best File Systems for Keeping SSD Healthy", "paragraph": "In today’s computer world, SSDs have become the mainstream storage that holds the operating system and all the important files instead of the traditional, mechanical HDDs. SSDs are definitely the ultimate storage solution in terms of performance and energy consumption. However, the cost of an SSD is still not as low as a mechanical HDD."},
{"url": "https://www.osradar.com/how-to-extend-your-pc-screen-using-your-android-device/", "title": "How to extend your PC screen using your Android device", "paragraph": "Nowadays it is more common to work with multi-screen environments, some users choose to use an ultra-panoramic monitor on their PC to maximize the viewing area. It is finally about that, to gain space to add more information in front of your eyes and here your phone or tablet can become a key tool because they can become a second screen for your desktop PC or laptop. This is where we are going to offer you an application that you can install on your Android and that will allow you to connect with both Mac and Windows to be able to operate as if it were an external screen via USB cable. Therefore, in this post, we will show you how to extend the screen of your PC using your Android device."},
{"url": "https://www.osradar.com/how-to-get-a-voice-alarm-when-the-battery-is-fully-charged/", "title": "How to get a voice alarm when the battery is fully charged", "paragraph": "Hello! Taking care of the battery life of your laptop is a priority. Indeed, this element tends to wear out with use. Therefore, we have told you how to get a complete report on the health of the battery. In addition, Windows has several options and power plans that allow you to save battery. Even the system warns when the charge is low or at a critical level. However, there is no system that warns the opposite. That is when the charge is at maximum. So today we will learn How to get a voice alarm when the battery is fully charged."},
{"url": "https://www.osradar.com/how-to-extract-a-frame-from-any-video-on-android/", "title": "How to extract a frame from any video on Android", "paragraph": "Greetings friends! There are times when we have recorded an epic video and we have seen a particular frame or image. Which we think is good enough to extract it and turn it into a photo. Luckily, today’s phones are becoming more and more like desktop computers. As they allow us to perform all kinds of tasks, including the ability to take a snapshot of a video frame. In this post, we will teach you how to extract a frame from any video on Android. You will learn the steps to follow to do it the right way. Using the best tricks and apps for Google’s mobile operating system."},
{"url": "https://www.osradar.com/how-to-install-dovecot-on-centos-8/", "title": "How to Install Dovecot on CentOS 8", "paragraph": "Today we are going to learn that how to install Dovecot on CentOS 8. Dovecot is an open source service for IMAP & POP3. It is fast and secure mail server here we will install and configure it on our CentOS 8 system. For easy installation just follow the below steps."},
{"url": "https://www.osradar.com/how-to-install-lmms-on-debian-10-ubuntu-20-04/", "title": "How to install LMMS on Debian 10 | Ubuntu 20.04?", "paragraph": "Hello, friends. We already know that Linux is widely used by many different people and this includes musicians. Therefore, today we will show you how to install LMMS on Debian 10 / Ubuntu 20.04"},
{"url": "https://www.osradar.com/how-to-install-microsoft-edge-chromium-using-group-policy/", "title": "How to Install Microsoft Edge (Chromium) Using Group Policy", "paragraph": "After the announcement to give up its own rendering engine and to use Chromium as a basis for Edge, the to-dos for Microsoft have been basically clear. In addition to adapting the Edge user interface to Chromium, these primarily include integration with Windows and the company’s own cloud services. "},
{"url": "https://www.osradar.com/how-to-install-freenet-on-windows/", "title": "How to install Freenet on Windows", "paragraph": "Hi! Have you heard of Freenet? If you’re passionate about anonymity on the Internet, maybe you’ve heard of it. Indeed, this project has been running for many years. Additionally, this is a program that allows you to share files, publish and visit websites. In addition, these sites are only accessible when using the program. Therefore, it is an escape route from censorship and political persecution on the Internet. Well, today we will see how to install Freenet on Windows 10."},
{"url": "https://www.osradar.com/how-to-install-and-configure-mamp-in-windows-10/", "title": "How to install and configure MAMP in Windows 10", "paragraph": "Hi! Today we’re going to talk a little about MAMP. This is an application pack that allows you to set up a web server. Indeed, it includes Apache, MySQL, and PHP installed and configured by default. Additionally, it is possible to use Nginx as a server. In addition to using various forms of web acceleration such as APC and eAccelerator. On the other hand, this local server environment was oriented to Mac systems. However, a Windows version is also provided. On the other hand, perhaps the most interesting thing is that its installation is independent. That is, it does not interfere with any other local web server you may have installed. Consequently, you can use it together with Xampp or Lamp for example. So today we’ll see how to install and configure MAMP in Windows 10."},
{"url": "https://www.osradar.com/how-to-install-pandorafms-on-centos-8/", "title": "How to install PandoraFMS on CentOS 8?", "paragraph": "Worldwide many IT infrastructures are running Linux on one of their servers. This opens the door to an endless number of different possibilities thanks to the many professional applications that support Linux natively. And if we are talking about such an important step as monitoring, then it is even more important to take advantage of it. So, in this post, I will show you how to install PandoraFMS on CentOS 8."},
{"url": "https://www.osradar.com/how-to-enable-remote-desktop-in-windows-server-2019-2016/", "title": "How to enable remote desktop in Windows Server 2019/2016", "paragraph": "One of the functions that Microsoft offers for support, is the remote desktop. In effect, by running it, it will be possible to connect to a computer running Windows. In addition, this action can be executed through a local connection. Similarly, you can use external connections through the Internet. Therefore, it is a great help for administration tasks. Since it is possible to access a computer, without being physically in front of it. To do this, the system uses Remote Desktop Protocol (RDP). Which offers various display options and remote inputs. It uses Windows-based network connections. On the other hand, RDP is designed to support different network types and multiple LAN protocols. In addition, it has the ability to support several virtual channels. Consequently, communication between the device and the encrypted data on the client’s mouse and keyboard is guaranteed. Here’s how to enable remote desktop in Windows Server 2019/2016. "},
{"url": "https://www.osradar.com/how-to-install-and-configure-pritunl-vpn-server-on-ubuntu-20-04/", "title": "How To Install and Configure Pritunl VPN Server On Ubuntu 20.04", "paragraph": "Today we are going to learn that how to install Pritunl VPN on Ubuntu 20.04. Pritunl VPN is an open source graphical interface tool that can be used easily. It provides an alternative way to the commercial VPN products. Pritunl VPN has the ability to give access to thousands of users at a time using cloud vpn network. So, let’s move towards the intallation process."},
{"url": "https://www.osradar.com/how-to-install-postgresql-11-on-fedora-29/", "title": "How to install PostgreSQL 11 on Fedora 29?", "paragraph": "Fedora is a great Linux distribution and I think we’ve made that clear. Therefore, it is the one chosen to develop applications and use the database. This article is about how to install PostgreSQL 11 on Fedora 29."},
{"url": "https://www.osradar.com/how-to-install-apps-on-android-auto/", "title": "How to install apps on Android Auto", "paragraph": "Hello friends! If you have a car with Android Auto, surely you are interested in getting the most out of it. For that, you must have the best compatible apps. In case you are new to using Android Auto. You may not be sure how to install them. Besides you need to know what are the best compatible apps. Normally you will install apps that are on Google Play. But there is also a method to get apps that are not in the Google store. So, in this post, we will show you how to install apps on Android Auto."},
{"url": "https://www.osradar.com/how-to-install-themes-using-miui-themer-on-a-xiaomi-redmi-and-poco-phone/", "title": "How to install themes using MIUI Themer on a Xiaomi, Redmi, and POCO phone", "paragraph": "Greetings friends! The cell phones of the Chinese brand Xiaomi. They are considered among the best options that you can currently find in the market for several reasons. A clear example is their classic quality-to-price ratio. The support they give to the devices they release to the market. And of course its durability. And we can not forget the possibility of being able to customize it easily. In this post, we will teach you how to install themes using MIUI Themer on a Xiaomi, Redmi, and POCO phone. A not so well known way to install themes that if you are a MIUI user will be useful for you."},
{"url": "https://www.osradar.com/install-flask-ubuntu-20-04/", "title": "Install Flask on Ubuntu 20.04", "paragraph": "Hello, friends. Python application development is at a fairly high point of popularity. This extends to all kinds of applications both web and desktop. Speaking of the web, today we will show you how to install Flask on Ubuntu 20.04 which is a microframework for making web applications with Python."},
{"url": "https://www.osradar.com/how-to-monitor-remote-linux-machines-with-nagios-on-linux/", "title": "How To Monitor Remote Linux Machines With Nagios on Linux", "paragraph": "Today we are going to learn that how to monitor remote Linux machines with Nagios on Linux. We’ve previously installed and configured Nagios on Ubuntu 20.04 and now we are moving forward to monitor the remote machines with Nagios. If you didn’t follow the previous article click on the below link first to set up the Nagios on your Ubuntu 20.04 system."},
{"url": "https://www.osradar.com/install-gnu-fortran-fedora-34/", "title": "Install GNU Fortran on Fedora 34", "paragraph": "Hello, friends. In this post, you will learn how to install GNU Fortran on Fedora 34. This programming language may seem forgotten by many but it is still important for others."},
{"url": "https://www.osradar.com/install-apache-maven-opensuse-15-2-15-1/", "title": "How to install Apache Maven on OpenSUSE 15.2 / 15.1?", "paragraph": "To manage projects done in Java, there is no better tool than Apache Maven. This fantastic tool, belonging to the Apache foundation, comes with predefined objectives to perform certain clearly defined tasks, such as code compilation and packaging."},
{"url": "https://www.osradar.com/how-to-install-opennms-on-centos-rhel-8/", "title": "How to Install OpenNMS on Centos / RHEL 8.", "paragraph": ""},
{"url": "https://www.osradar.com/how-to-install-proftpd-on-rhel-8/", "title": "How to install PROFTPD on RHEL 8", "paragraph": "ProFTPD (Pro FTP daemon) is an FTP server. ProFTPD is Free and open-source software, compatible with Unix-like systems. Along with vsftpd and Pure-FTPd, ProFTPD is among the most popular FTP servers in Unix-like environments today. Compared to those, which focus e.g. on simplicity, speed or security, ProFTPD’s primary design goal is to be a highly feature rich FTP server, exposing a large amount of configuration options to the user. By following below instruction you will learn that how to intsall PROFTPD on RHEL 8 server."},
{"url": "https://www.osradar.com/install-microsoft-teams-ubuntu-20-04-debian-10/", "title": "How to install Microsoft Teams on Ubuntu 20.04 / Debian 10?", "paragraph": "The truth is that we are still at home because of the pandemic. As we well know this brings as a consequence that a lot of work has to be done remotely. However, the problem arises when it is necessary to organize and agree between several teams."},
{"url": "https://www.osradar.com/install-netdata-rocky-linux-monitoring-tool-server/", "title": "How to install Netdata on Rocky Linux 8 / AlmaLinux 8 / CentOS 8", "paragraph": "Hello, friends. These days we are very busy with the migration from CentOS 8 to Rocky Linux 8 and in this sense learning how to install monitoring tools can be helpful. So, in this post, you will learn how to install Netdata on Rocky Linux 8 / AlmaLinux 8 / CentOS 8."},
{"url": "https://www.osradar.com/install-nextcloud-centos-8-rhel-8-oracle-linux-8/", "title": "Install Nextcloud on CentOS 8 /RHEL 8 / Oracle Linux 8", "paragraph": "Nextcloud is a very useful application that allows us to create a private cloud. Thanks to it, any company can create a server dedicated to its data. So you will have absolute control of them. This is important because privacy and file security are currently highly valued. But it is also quite useful if we have a personal server and we want to have our data backed up without having to entrust our data to third parties. Anyway, in this post, you will learn to install Nextcloud on CentOS 8 / RHEL 8."},
{"url": "https://www.osradar.com/install-nfs-server-client-centos7-redhat-7/", "title": "Install NFS Server and Client in CentOS 7 and Redhat 7", "paragraph": "NFS (Network File System) is the popular distributed filesystem protocol. It’s better for users to mount remote folders on their local servers. Here, we will explain step by step how to create NFS server and how to mount the shared directories from the NFS clients."},
