[
{"url": "https://www.osradar.com/how-to-install-wkhtmltopdf-and-wkhtmltoimage-on-ubuntu-19-04-debian-10/", "title": "How To Install wkhtmltopdf and wkhtmltoimage on Ubuntu 19.04 / Debian 10", "paragraph": "Today we are going to learn that how we can convert our web pages from html format to pdf or image format. For obtaining these results we’ll use the most famous command line tools wkhtmltopdf & wkhtmltoimage. They are Open Source Command line tools used for conversion processes from html to pdf and image respectively.They both use the QT WebKit rendering engine to perform the actions.By default, the versions available on Ubuntu are old for these tools. So, we have to Install them manually. Follow the guide to get started that how we can Install wkhtmltopdf & wkhtmltoimage on Ubuntu 19.04 Linux. First of all we’ll download the tools from .deb package. Further these tools do not require a display so they are entirely headless."},
{"url": "https://www.osradar.com/how-to-install-openshot-video-editor-on-linux/", "title": "How to Install OpenShot Video Editor on Linux", "paragraph": "Linux is one of the most powerful OS in the world. However, because it’s not so popular and has complex system configuration, there are not so much software available on the platform. If you’re a Linux user, you already understand that. Although there are many powerful tools to perform everyday tasks, a video editor may be a good example. The most popular ones like Adobe Premiere, Final Cut Pro or Sony Vegas aren’t available as a native program on Linux, but that doesn’t mean that there’s no industry-standard editing tool."},
{"url": "https://www.osradar.com/how-to-install-rstudio-ubuntu-20-04-18-04/", "title": "How to install RStudio on Ubuntu 20.04 / 18.04", "paragraph": "No matter how complete and robust a programming language is, the programmer will always need a tool to write the code. These programs have to be complete and with features that can speed up the coding process. We usually call these programs IDE. There are IDEs that support many languages making them a Swiss army knife but there are others that are more specialized. So in this post, I will show you how to install RStudio on Ubuntu 20.04 / 18.04. It is almost impossible to write R code without using RStudio."},
{"url": "https://www.osradar.com/how-to-instll-and-configure-nfs-client-on-ubuntu-18-04/", "title": "How To Install and Configure NFS Client on Ubuntu 18.04", "paragraph": "In previous tutorial we’ve cover the installation of NFS Server on Ubuntu. In this tutorial, you’ll cover only the configuration of NFS Client on Ubuntu 18.04. So, we already cover the introduction in the previous guide. Let’s start with some basic points."},
{"url": "https://www.osradar.com/how-to-install-php-in-windows-10/", "title": "How to install PHP in Windows 10", "paragraph": "Hi, how are you? Today I’m going to talk to you about PHP.  It is a general-purpose server-side code and interpreted programming language,  also is suitable for web development and can be embedded in HTML. Additionally, PHP has multiple ways of being used, since it can be used with scripts, in a structured way or programming in objects. Likewise, it is mainly used to create web pages, to create dynamic content and to work with databases and HTML. On the other hand, it supports most databases: MySQL, PostgreSQL, SQL Server, MongoDB. Because of these features, millions of web pages use PHP. Therefore, let’s see how to install PHP in Windows 10."},
{"url": "https://www.osradar.com/how-to-install-opencv-on-ubuntu-20-04/", "title": "How To Install OpenCV on Ubuntu 20.04", "paragraph": "OpenCV is an open source, highly optimized computer library mainly used in applications for image processing. It has variety of inbuilt images processing functions helping you to get started easily. You can read the documentation to handle OpenCV in more easy way. Here I’ll list the main & important modules in the project."},
{"url": "https://www.osradar.com/how-to-install-the-lastest-otrs-on-ubuntu-18-04/", "title": "How to install the lastest OTRS on Ubuntu 18.04?", "paragraph": "OTRS (Open-Source Ticket Request System) is a free system that any institution can use to assign unique identifiers called tickets to service or information requests. Very useful in IT support departments to control and respond to requests made by users within an organization."},
{"url": "https://www.osradar.com/how-to-make-a-backup-on-linux-with-luckybackup/", "title": "How to make a backup on Linux with LuckyBackup?", "paragraph": "Linux is a fairly stable system and many people who use it attest to that. However, as with any system, it is possible that it may fail and we may have to reinstall. In this case, the main damaged the stored information. To avoid this, it is recommended that periodically, back up the system, so that if required, we have everything safe. So, today you will learn how to make a backup on Linux. For it, we will use LuckyBackup."},
{"url": "https://www.osradar.com/how-to-setup-wireguard-vpn-with-ubuntu-20-04/", "title": "How to setup WireGuard VPN with ubuntu 20.04", "paragraph": "Here, we will learn today how to configure WireGuard VPN with Ubuntu 20.04. Wireguard® is an amazingly straightforward yet quick and present-day VPN that uses cutting edge cryptography. It expects to be quicker and more straightforward. It means to be significantly more performant than OpenVPN. At first, was released for the Linux part, WireGuard VPN is currently cross-stage (Windows, macOS, BSD, iOS, Android) and broadly deployable."},
{"url": "https://www.osradar.com/how-to-update-to-miui-13-on-your-xiaomi-redmi-and-poco-phone/", "title": "How to update to MIUI 13 on your Xiaomi, Redmi, and POCO phone", "paragraph": "Hello friends! MIUI 13 is finally here, it comes with Android 12. It is coming to most devices, in its global version. The mobile operating system based on Android from Xiaomi comes loaded with new features and performance improvements. Although the deployment has already reached most devices, there are still a few missing to receive the update by OTA (Over the air). It is possible to perform this update manually and in a fairly simple way. It is also possible that the update is not yet available for the region of your device. And because of this, there may be some delay. Therefore, in this post, we will show you how to update your Xiaomi, Redmi, and POCO phones to MIUI 13."},
{"url": "https://www.osradar.com/how-to-install-percona-centos-8/", "title": "How to install Percona on CentOS 8?", "paragraph": "Database management is an essential part of any application. And there are many solutions but some are more business-oriented than others, and today I will show you how to install Percona on CentOS 8. With Percona you will have a professional SQL database manager 100% compatible with MySQL."},
{"url": "https://www.osradar.com/how-to-register-and-override-dll-files-in-windows-10/", "title": "How to register and override DLL files in Windows 10", "paragraph": "Windows 10 is a system of enormous complexity. Therefore, it requires many components to work well. One of these components is the DLL libraries. Indeed, these files are essential for the proper functioning of installed apps. They even include elements such as commands, graphics, and fonts. However, mistakes can happen. Because when installing a program, the DLL files are not registered correctly. Or during the update, the link between it and the program is broken. Therefore, today we will see how to solve it. See how to register and override DLL files in Windows 10."},
{"url": "https://www.osradar.com/how-to-view-fps-in-android-without-root/", "title": "How to view FPS in Android without Root", "paragraph": "Hello folks, every time we play games on our Android, we want to have the best experience, to ensure that our games run as smoothly as possible we must verify the rate of frames per second. In this post, we will show you how to view the FPS without Root. The first thing you must note is that the FPS is limited by the refresh rate of your device screen. Most phones on the market have 60hz screens which are capable of displaying 60 frames per second. From 30 FPS you will have a better and more fluid experience. The most current devices have 90hz and 120hz screens. Although their screens are capable of displaying those frames per second, it depends on the power of the phone."},
{"url": "https://www.osradar.com/how-to-make-the-best-3d-letters-on-android-or-ios/", "title": "How to make the best 3D letters on Android or IOS", "paragraph": "Greetings my dear friends, today we bring you a simple guide to make the best 3D letters from your mobile device. These letters can be used to create banners for your social networks or website, also to use them in your Youtube thumbnails. A really useful trick that you should learn now. PixelLab is an app that is available for both Android and IOS. It has a simple interface easy to use. In addition to different tools that you can take advantage of to get good results. Some of its features are, text editing, 3D text, Text effects: make text stand out with dozens of text effects such as Shadow, Inner Shadow, Stroke, Background, Reflection, Emboss, Mask. In this post, we will show you how to make the best 3D letters on Android or IOS."},
{"url": "https://www.osradar.com/install-mattermost-ubuntu/", "title": "Install Mattermost on Ubuntu 20.04 (With MariaDB)", "paragraph": "Hello, friends in this post you will learn how to install Mattermost on Ubuntu 20.04. These steps I’m going to describe are easy to follow and you should have no problems to achieve the installation."},
{"url": "https://www.osradar.com/install-apache-solr-7-5-on-centos-rhel-7-fedora-28-29/", "title": "Install Apache Solr 7.5 on CentOS/RHEL 7, Fedora 28-29", "paragraph": "Apache Solr is a standalone enterprise search server with a REST-like API. its an opensource search platform written on Java You put documents in it (called “indexing”) via JSON, XML, CSV or binary over HTTP. You query it via HTTP GET and receive JSON, XML, CSV or binary results."},
{"url": "https://www.osradar.com/install-eclipse-on-arch-linux/", "title": "Install Eclipse on Arch Linux", "paragraph": "For developers, having the suitable IDE is extremely necessary for the maximum output. In fact, a good IDE can dramatically reduce the strain on a programmer with various helping tools at disposal."},
{"url": "https://www.osradar.com/install-mlocate-in-freebsd/", "title": "Install  mlocate in FreeBSD", "paragraph": "if you came from Linux word then  is mlocate  is very  familiar for you , is one of the best ways to find files and Folders,  in Linux  the the package called  mlocate  and is  you can install via Linux package management "},
{"url": "https://www.osradar.com/install-rust-programming-language-ubuntu-debian/", "title": "How to install Rust Programming language on Ubuntu 20.04 / Debian 10?", "paragraph": "Learning programming languages is a good option to find a good job. Above all, if you dedicate yourself to this. Because for no one is a secret that we live in times where many applications are used. That’s why this post will teach you how to install Rust on Ubuntu 20.04 / Debian 10."},
{"url": "https://www.osradar.com/install-suitecrm-ubuntu-20-04/", "title": "How to install SuiteCRM on Ubuntu 20.04?", "paragraph": "SuiteCRM is an application that loads the sales, markets, and services administration of a company. It also helps to organize all the processes concerning these activities translating this into process improvements and time-saving."},
{"url": "https://www.osradar.com/install-zabbix-opensuse-15-1-leap/", "title": "How to install Zabbix on OpenSUSE 15.1 Leap?", "paragraph": "There are too many features that make Zabbix a necessary tool in a network because with it the sysadmin can have detailed information about what happens in it. In addition, you can have real-time monitoring with their due reports."},
{"url": "https://www.osradar.com/install-clamav-debian-ubuntu/", "title": "Install ClamAV on Debian 10 / Debian 9/ Ubuntu 20.04/ 18.04", "paragraph": "Are there viruses in Linux? The answer is yes, the point is that Linux is a very secure system that minimizes risks. However, when you use a Linux server on a network where there are many clients using Windows, it is useful to install ClamAV to remove those viruses."},
{"url": "https://www.osradar.com/install-libreoffice-6-4-ubuntu-linux-mint/", "title": "How to install LibreOffice 6.4 on Ubuntu 18.04 / Linux Mint 19?", "paragraph": "LibreOffice has just released its latest version. And it promises to be a whole new performance experience. In this post, we will show you how to install LibreOffice 6.4 on Ubuntu 18.04 / Linux Mint 19."},
{"url": "https://www.osradar.com/step-by-step-installation-of-microsoft-exchange-server-2019/", "title": "Step By Step Installation Exchange Server 2019", "paragraph": "Exchange Server 2019 requires Windows Server 2019. Exchange Server 2019 brings a new set of technologies, features, and services to Exchange Server, the messaging platform that provides email, scheduling, and tools for custom collaboration and messaging service applications. Its goal is to support people and organizations as their work habits evolve from a communication focus to a collaboration focus. At the same time, Exchange 2019 helps lower the total cost of ownership.  whether you deploy Exchange 2019 on-premises or provision your mailboxes in the cloud."},
{"url": "https://www.osradar.com/wide-launcher-enhance-your-home-screen/", "title": "Wide Launcher: Enhance your home screen", "paragraph": "Greetings friends, in this opportunity we bring you a new Launcher, so you can take full advantage of your device. Remember that Launchers are this type of apps that has the task of launching all the apps installed on your devices. One of the benefits of the Android mobile operating system is that it has a great variety of Launchers available. In this post, we will show you how to enhance your home screen."},
{"url": "https://www.osradar.com/yum-the-centos-package-manager-a-little-guide-to-use-it/", "title": "YUM the CentOS package manager: A little guide to use it", "paragraph": "The package manager is one of the essential components of the system. With them, we can install packages that often contain the applications we need for daily work. It is practically impossible to conceive of an operating system without a package manager. So, obviously, CentOS 7 has one. In this article, ideal for novices, we will teach you how to use YUM the CentOS 7 package manager. So, this way you will be able to take full advantage of this utility."},
{"url": "https://www.osradar.com/install-wing-python-ide-ubuntu/", "title": "Install Wing Python IDE on Ubuntu 20.04 /18.04", "paragraph": "Python is one of the most popular programming languages out there. In fact, many universities already use it as an introductory language in the retirement of the old Pascal or C++. This has made many users already know firsthand the potential of the language that is very broad. The main reason to affirm this is that Python can be used in many parts as the main language or as a composite. However, to be more productive with the language requires an IDE at the height. For Java, we already have free solutions like Eclipse and Netbeans but in this post, I will show you Install Wing Python IDE on Ubuntu 20.04 /18.04."},
{"url": "https://www.osradar.com/install-rust-opensuse/", "title": "How to install Rust Programming Language on OpenSUSE 15.2?", "paragraph": "Learning programming languages is a good option to find a good job. Above all, if you dedicate yourself to this. Because for no one is a secret that we live in times where many applications are used. That’s why this post will teach you how to install Rust on OpenSUSE 15.2"},
{"url": "https://www.osradar.com/5-windows-pe-rescue-environments-for-repair-and-maintenance/", "title": "5 Windows PE rescue environments for repair and maintenance", "paragraph": "Hello! Windows PE or Windows Preinstallation Environment is a light version of Windows with a specific function. Indeed, Microsoft implements this version to help install, deploy, deploy, repair and maintain in the best conditions of use the complete editions of desktop Windows. Additionally, it also works for Windows Server. Let me clarify that Windows PE is a fully functional and operational version. However, it cannot be used as a day-to-day client system. In fact, to avoid such uses, Windows PE automatically stops shell execution and restarts after 72 hours of continuous use. Additionally, this period cannot be extended or customized. So without further ado, let’s see 5 Windows PE rescue environments for repair and maintenance."},
{"url": "https://www.osradar.com/best-pinball-games-for-windows-10/", "title": "Best Pinball Games for Windows 10", "paragraph": "Games are always an inseparable part of our computers, right? We always love to play our favorite games like Spider Solitaire or Hearts to either pass leisure times or relax a bit. to either pass leisure times or relax a bit. Speaking of games, pinball is possibly the easiest and one of the most popular ones for Windows users. The debut of pinball was first introduced with Windows XP. However, we didn’t have the awesome game built-in with the next generations of Windows. Thankfully, Windows 10 comes up with a rich app store that contains lots of small and awesome games for playing."},
{"url": "https://www.osradar.com/best-file-systems-for-keeping-ssd-healthy/", "title": "Best File Systems for Keeping SSD Healthy", "paragraph": "In today’s computer world, SSDs have become the mainstream storage that holds the operating system and all the important files instead of the traditional, mechanical HDDs. SSDs are definitely the ultimate storage solution in terms of performance and energy consumption. However, the cost of an SSD is still not as low as a mechanical HDD."},
{"url": "https://www.osradar.com/organize-your-library-by-installing-koha-on-debian-10/", "title": "Organize your library by installing Koha on Debian 10", "paragraph": "There is much open-source software and all of them are quite useful in our work. In this post, you will learn how to install Koha on Debian 10 and manage a library easily."},
{"url": "https://www.osradar.com/category/tutorials/", "title": "Tutorials", "paragraph": ""},
{"url": "https://www.osradar.com/ninite-a-tool-to-automatically-install-programs-in-windows-10/", "title": "Ninite, a tool to automatically install programs in Windows 10.", "paragraph": "Hello, how are you? Every time we format our computer or when we release one. Then we have the task of downloading the programs we need to work. This is tedious work but necessary to be able to work comfortably. Additionally, it requires time and dedication on the part of the user. However, there is a way to install all these programs automatically. With a few mouse clicks, we will be able to automate the process. So here’s how to install programs automatically in Windows 10. "},
{"url": "https://www.osradar.com/reset-windows-10-password/", "title": "How to Reset Windows 10 Password", "paragraph": "Forgetting passwords is nothing new, but happens with most us a lot of time. If you forget your computer’s password which is running on Windows 10, don’t panic! This tutorial will help you to reset Windows 10 password in several ways. Some of the methods may seem technical, but you will reset the password and make your Windows 10 computer usable again by following the steps."},
{"url": "https://www.osradar.com/how-to-activate-pocket-mode-on-your-android-phone/", "title": "How to activate Pocket Mode on your Android phone", "paragraph": "Greetings friends! This time we will tell you about Pocket Mode. An add-on that can help you avoid making accidental calls when you are not using your cell phone. Surely you have seen that many manufacturers have a Pocket Mode option on the latest Android phones. In this post, we are going to show you how to activate pocket mode on your Android phone. Because, although it may not seem like it can be one of the most important features of Android, besides being quite useful. This option is present in custom versions of Android from many manufacturers. Also in the stock version of Android, it is most likely available on most mobile devices. With Pocket Mode, you will avoid accidental calls to other people and other misunderstandings that arise when you unintentionally touch the screen."},
{"url": "https://www.osradar.com/how-to-change-the-default-boot-system-in-windows-10/", "title": "How to change the default boot system in Windows 10.", "paragraph": "You may find the title of this post confusing. In fact, if you have only one operating system installed, then this is not for you! However, sometimes some users have more than one version of Windows installed on their computer. Or even GNU/Linux or macOS versions. Well, in those cases it is advisable to have multiboot properly configured. That is to say, a boot manager that allows choosing the system with which we want to start. Well, in this post we will see how to change the default boot system in Windows 10."},
{"url": "https://www.osradar.com/how-and-why-you-should-enable-hyper-v-in-windows-11/", "title": "How and why you should enable Hyper-V in Windows 11", "paragraph": "Hello! Have you heard about virtual machines? Do you know what virtualization is? Did you know that Windows 11 has its own virtualization approach already included? Well, we will try to answer those questions in this post. Just so we understand, Hyper-V is Microsoft’s internal virtualization solution for Windows 11. Thanks to this tool, we will be able to create virtual machines and run them on virtual hardware. It was first introduced in Windows Server 2008. In fact, the definitive version was released in June of the same year. With the launch of Windows 8 it reached all users. We also saw it in later versions such as Windows 8.1, Windows 10 or Windows 11. Let us see how we can take advantage of it and how we can enable Hyper-V. In addition to how to create virtual machines without using third-party tools."},
{"url": "https://www.osradar.com/how-to-delete-dll-files-in-windows-10/", "title": "How to delete DLL files in Windows 10", "paragraph": "Hello! How are you? A DLL file is an essential part of many applications developed for Windows. In fact, inside a DLL there is an executable code that allows a software to work properly. However, removing certain DLL can have disastrous results. That’s why it is necessary to know that the files to be deleted are not essential. Otherwise, the operating system could stop working. It could even come to a complete standstill. On the other hand, removing DLL that are no longer used can be beneficial to the performance and health of your computer. Since they are usually residues of already deleted programs. For that reason, today we will see how to delete DLL files in Windows 10."},
{"url": "https://www.osradar.com/how-to-download-songs-from-spotify-for-free/", "title": "How to download songs from Spotify for free", "paragraph": "Hi! The way we listen to music has changed over the years. Some time ago, with the physical format such as vinyl, cassette, or CD. However, everything has evolved to the possibility of listening to it in a file, or via streaming. On the other hand, if you were a Spotify user, surely at some point you will have missed the possibility to download the songs. Therefore, we can play them on any device we want. Certainly, Spotify is one of the most popular platforms, with more than 50 million songs available for both computers and cell phones. In addition, the service has a free version that allows us to listen to music randomly, in exchange for listening to ads every certain period of time. Today, we will learn how to download songs from Spotify free."},
{"url": "https://www.osradar.com/how-to-download-your-photos-from-xiaomi-cloud-before-it-closes/", "title": "How to download your photos from Xiaomi Cloud before it closes", "paragraph": "Greetings friends! Xiaomi plans to discontinue its Xiaomi Cloud services for your gallery items. Last year Xiaomi released a statement with the shocking news. Now we come to remind you about the closure of Xiaomi Cloud because there are only a few days left before the discontinuation of this service. So you’d better get ready and transfer all gallery items from Xiaomi Cloud to your device. In this post, we will show you how to download your photos from Xiaomi Cloud before it closes."},
{"url": "https://www.osradar.com/how-to-enable-remote-desktop-in-windows-server-2019-2016/", "title": "How to enable remote desktop in Windows Server 2019/2016", "paragraph": "One of the functions that Microsoft offers for support, is the remote desktop. In effect, by running it, it will be possible to connect to a computer running Windows. In addition, this action can be executed through a local connection. Similarly, you can use external connections through the Internet. Therefore, it is a great help for administration tasks. Since it is possible to access a computer, without being physically in front of it. To do this, the system uses Remote Desktop Protocol (RDP). Which offers various display options and remote inputs. It uses Windows-based network connections. On the other hand, RDP is designed to support different network types and multiple LAN protocols. In addition, it has the ability to support several virtual channels. Consequently, communication between the device and the encrypted data on the client’s mouse and keyboard is guaranteed. Here’s how to enable remote desktop in Windows Server 2019/2016. "},
{"url": "https://www.osradar.com/how-to-extend-your-pc-screen-using-your-android-device/", "title": "How to extend your PC screen using your Android device", "paragraph": "Nowadays it is more common to work with multi-screen environments, some users choose to use an ultra-panoramic monitor on their PC to maximize the viewing area. It is finally about that, to gain space to add more information in front of your eyes and here your phone or tablet can become a key tool because they can become a second screen for your desktop PC or laptop. This is where we are going to offer you an application that you can install on your Android and that will allow you to connect with both Mac and Windows to be able to operate as if it were an external screen via USB cable. Therefore, in this post, we will show you how to extend the screen of your PC using your Android device."},
{"url": "https://www.osradar.com/how-to-extract-a-frame-from-any-video-on-android/", "title": "How to extract a frame from any video on Android", "paragraph": "Greetings friends! There are times when we have recorded an epic video and we have seen a particular frame or image. Which we think is good enough to extract it and turn it into a photo. Luckily, today’s phones are becoming more and more like desktop computers. As they allow us to perform all kinds of tasks, including the ability to take a snapshot of a video frame. In this post, we will teach you how to extract a frame from any video on Android. You will learn the steps to follow to do it the right way. Using the best tricks and apps for Google’s mobile operating system."},
{"url": "https://www.osradar.com/how-to-install-apps-on-android-auto/", "title": "How to install apps on Android Auto", "paragraph": "Hello friends! If you have a car with Android Auto, surely you are interested in getting the most out of it. For that, you must have the best compatible apps. In case you are new to using Android Auto. You may not be sure how to install them. Besides you need to know what are the best compatible apps. Normally you will install apps that are on Google Play. But there is also a method to get apps that are not in the Google store. So, in this post, we will show you how to install apps on Android Auto."},
{"url": "https://www.osradar.com/how-to-install-and-configure-pritunl-vpn-server-on-ubuntu-20-04/", "title": "How To Install and Configure Pritunl VPN Server On Ubuntu 20.04", "paragraph": "Today we are going to learn that how to install Pritunl VPN on Ubuntu 20.04. Pritunl VPN is an open source graphical interface tool that can be used easily. It provides an alternative way to the commercial VPN products. Pritunl VPN has the ability to give access to thousands of users at a time using cloud vpn network. So, let’s move towards the intallation process."},
{"url": "https://www.osradar.com/how-to-install-freenet-on-windows/", "title": "How to install Freenet on Windows", "paragraph": "Hi! Have you heard of Freenet? If you’re passionate about anonymity on the Internet, maybe you’ve heard of it. Indeed, this project has been running for many years. Additionally, this is a program that allows you to share files, publish and visit websites. In addition, these sites are only accessible when using the program. Therefore, it is an escape route from censorship and political persecution on the Internet. Well, today we will see how to install Freenet on Windows 10."},
{"url": "https://www.osradar.com/how-to-install-lmms-on-debian-10-ubuntu-20-04/", "title": "How to install LMMS on Debian 10 | Ubuntu 20.04?", "paragraph": "Hello, friends. We already know that Linux is widely used by many different people and this includes musicians. Therefore, today we will show you how to install LMMS on Debian 10 / Ubuntu 20.04"},
{"url": "https://www.osradar.com/how-to-install-microsoft-edge-chromium-using-group-policy/", "title": "How to Install Microsoft Edge (Chromium) Using Group Policy", "paragraph": "After the announcement to give up its own rendering engine and to use Chromium as a basis for Edge, the to-dos for Microsoft have been basically clear. In addition to adapting the Edge user interface to Chromium, these primarily include integration with Windows and the company’s own cloud services. "},
{"url": "https://www.osradar.com/how-to-get-a-voice-alarm-when-the-battery-is-fully-charged/", "title": "How to get a voice alarm when the battery is fully charged", "paragraph": "Hello! Taking care of the battery life of your laptop is a priority. Indeed, this element tends to wear out with use. Therefore, we have told you how to get a complete report on the health of the battery. In addition, Windows has several options and power plans that allow you to save battery. Even the system warns when the charge is low or at a critical level. However, there is no system that warns the opposite. That is when the charge is at maximum. So today we will learn How to get a voice alarm when the battery is fully charged."},
{"url": "https://www.osradar.com/how-to-install-and-configure-mamp-in-windows-10/", "title": "How to install and configure MAMP in Windows 10", "paragraph": "Hi! Today we’re going to talk a little about MAMP. This is an application pack that allows you to set up a web server. Indeed, it includes Apache, MySQL, and PHP installed and configured by default. Additionally, it is possible to use Nginx as a server. In addition to using various forms of web acceleration such as APC and eAccelerator. On the other hand, this local server environment was oriented to Mac systems. However, a Windows version is also provided. On the other hand, perhaps the most interesting thing is that its installation is independent. That is, it does not interfere with any other local web server you may have installed. Consequently, you can use it together with Xampp or Lamp for example. So today we’ll see how to install and configure MAMP in Windows 10."},
{"url": "https://www.osradar.com/how-to-monitor-remote-linux-machines-with-nagios-on-linux/", "title": "How To Monitor Remote Linux Machines With Nagios on Linux", "paragraph": "Today we are going to learn that how to monitor remote Linux machines with Nagios on Linux. We’ve previously installed and configured Nagios on Ubuntu 20.04 and now we are moving forward to monitor the remote machines with Nagios. If you didn’t follow the previous article click on the below link first to set up the Nagios on your Ubuntu 20.04 system."},
{"url": "https://www.osradar.com/how-to-install-proftpd-on-rhel-8/", "title": "How to install PROFTPD on RHEL 8", "paragraph": "ProFTPD (Pro FTP daemon) is an FTP server. ProFTPD is Free and open-source software, compatible with Unix-like systems. Along with vsftpd and Pure-FTPd, ProFTPD is among the most popular FTP servers in Unix-like environments today. Compared to those, which focus e.g. on simplicity, speed or security, ProFTPD’s primary design goal is to be a highly feature rich FTP server, exposing a large amount of configuration options to the user. By following below instruction you will learn that how to intsall PROFTPD on RHEL 8 server."},
{"url": "https://www.osradar.com/how-to-install-themes-using-miui-themer-on-a-xiaomi-redmi-and-poco-phone/", "title": "How to install themes using MIUI Themer on a Xiaomi, Redmi, and POCO phone", "paragraph": "Greetings friends! The cell phones of the Chinese brand Xiaomi. They are considered among the best options that you can currently find in the market for several reasons. A clear example is their classic quality-to-price ratio. The support they give to the devices they release to the market. And of course its durability. And we can not forget the possibility of being able to customize it easily. In this post, we will teach you how to install themes using MIUI Themer on a Xiaomi, Redmi, and POCO phone. A not so well known way to install themes that if you are a MIUI user will be useful for you."},
{"url": "https://www.osradar.com/how-to-install-dovecot-on-centos-8/", "title": "How to Install Dovecot on CentOS 8", "paragraph": "Today we are going to learn that how to install Dovecot on CentOS 8. Dovecot is an open source service for IMAP & POP3. It is fast and secure mail server here we will install and configure it on our CentOS 8 system. For easy installation just follow the below steps."},
{"url": "https://www.osradar.com/how-to-install-pandorafms-on-centos-8/", "title": "How to install PandoraFMS on CentOS 8?", "paragraph": "Worldwide many IT infrastructures are running Linux on one of their servers. This opens the door to an endless number of different possibilities thanks to the many professional applications that support Linux natively. And if we are talking about such an important step as monitoring, then it is even more important to take advantage of it. So, in this post, I will show you how to install PandoraFMS on CentOS 8."},
{"url": "https://www.osradar.com/how-to-install-opennms-on-centos-rhel-8/", "title": "How to Install OpenNMS on Centos / RHEL 8.", "paragraph": ""},
{"url": "https://www.osradar.com/install-apache-maven-opensuse-15-2-15-1/", "title": "How to install Apache Maven on OpenSUSE 15.2 / 15.1?", "paragraph": "To manage projects done in Java, there is no better tool than Apache Maven. This fantastic tool, belonging to the Apache foundation, comes with predefined objectives to perform certain clearly defined tasks, such as code compilation and packaging."},
{"url": "https://www.osradar.com/install-flask-ubuntu-20-04/", "title": "Install Flask on Ubuntu 20.04", "paragraph": "Hello, friends. Python application development is at a fairly high point of popularity. This extends to all kinds of applications both web and desktop. Speaking of the web, today we will show you how to install Flask on Ubuntu 20.04 which is a microframework for making web applications with Python."},
{"url": "https://www.osradar.com/install-go-programming-language-opensuse-15-2/", "title": "How to install Go programming language on OpenSUSE 15.2?", "paragraph": "OpenSUSE is a great operating system that comes from the hand of SUSE. That’s why it’s a good target for developers all over the world. Also because it is robust and has great support for languages like Go. So in this post, you can learn how to install Go programming language on OpenSUSE 15.2."},
{"url": "https://www.osradar.com/how-to-install-postgresql-11-on-fedora-29/", "title": "How to install PostgreSQL 11 on Fedora 29?", "paragraph": "Fedora is a great Linux distribution and I think we’ve made that clear. Therefore, it is the one chosen to develop applications and use the database. This article is about how to install PostgreSQL 11 on Fedora 29."},
{"url": "https://www.osradar.com/install-gnu-fortran-fedora-34/", "title": "Install GNU Fortran on Fedora 34", "paragraph": "Hello, friends. In this post, you will learn how to install GNU Fortran on Fedora 34. This programming language may seem forgotten by many but it is still important for others."},
{"url": "https://www.osradar.com/how-to-solve-the-access-denied-for-root-error-on-phpmyadmin-log-in/", "title": "How to solve the “Access denied for root” error on PhpMyAdmin log in?", "paragraph": "In our recent article, we explain how to install the latest PhpMyAdmin on Ubuntu 18.04. We explain the advantages that this may have. For example, with the updates to the program improves its usability and stability. This is important when working with data. However, you may not be able to log in as a root user. That is why in this post I will show you How to solve the “Access denied for root” error on PhpMyAdmin log in?"},
{"url": "https://www.osradar.com/install-netdata-rocky-linux-monitoring-tool-server/", "title": "How to install Netdata on Rocky Linux 8 / AlmaLinux 8 / CentOS 8", "paragraph": "Hello, friends. These days we are very busy with the migration from CentOS 8 to Rocky Linux 8 and in this sense learning how to install monitoring tools can be helpful. So, in this post, you will learn how to install Netdata on Rocky Linux 8 / AlmaLinux 8 / CentOS 8."},
{"url": "https://www.osradar.com/install-nfs-server-client-centos7-redhat-7/", "title": "Install NFS Server and Client in CentOS 7 and Redhat 7", "paragraph": "NFS (Network File System) is the popular distributed filesystem protocol. It’s better for users to mount remote folders on their local servers. Here, we will explain step by step how to create NFS server and how to mount the shared directories from the NFS clients."},
{"url": "https://www.osradar.com/install-ocsinventory-debian-10/", "title": "How to install OCSInventory on Debian 10?", "paragraph": "OCSInventory allows you to collect hardware and software inventory from all active devices on the network, such as computers, switches, routers, network printers and unattended devices. It Supports for multiple operating systems, including Microsoft Windows, Linux, * BSD, Sun Solaris, IBM AIX, HP-UX, MacOS X. It has the ability to support Plugins and integrates seamlessly with GLPI."},
{"url": "https://www.osradar.com/install-orientdb-on-rhel-8-centos-8/", "title": "Install OrientDB on RHEL 8 / CentOS 8", "paragraph": "OrientDB is an open source NoSQL database management system written in Java. It is a Multi-model database, supporting graph, document, key/value, and object models but the relationships are managed as in graph databases with direct connections between records. It supports schema-less, schema-full and schema-mixed modes. It has a strong security profiling system based on users and roles and supports querying with Gremlin along with SQL extended for graph traversal. OrientDB uses several indexing mechanisms based on B-tree and Extendible hashing, the last one is known as “hash index”, there are plans to implement LSM-tree and Fractal tree index based indexes. Each record has Surrogate key which indicates position of record inside of Array list , links between records are stored either as single value of record’s position stored inside of referrer or as B-tree of record positions (so-called record IDs or RIDs) which allows fast traversal (with O(1) complexity) of one-to-many relationships and fast addition/removal of new links. OrientDB is the third most popular graph database according to the DB-Engines graph database ranking, as of September 2017."},
{"url": "https://www.osradar.com/install-microsoft-teams-ubuntu-20-04-debian-10/", "title": "How to install Microsoft Teams on Ubuntu 20.04 / Debian 10?", "paragraph": "The truth is that we are still at home because of the pandemic. As we well know this brings as a consequence that a lot of work has to be done remotely. However, the problem arises when it is necessary to organize and agree between several teams."},
{"url": "https://www.osradar.com/install-the-latest-version-gcc-ubuntu-debian/", "title": "Install the latest version of GCC on Ubuntu 20.04?", "paragraph": "Hello, friends. For many people installing the latest version of GCC can be quite important for daily work. So in this post, you will learn how to do it so that it can also help you with your tasks."},
{"url": "https://www.osradar.com/install-ralph-cmdb-asset-management-system-on-ubuntu-18-04/", "title": "Install Ralph CMDB / Asset Management system on Ubuntu 18.04", "paragraph": "Today we are going to learn that how to install Ralph Assest Management System on Ubuntu 18.04. Ralph is an Open Source, full-featured Asset Management, DCIM and CMDB gadget for records facilities and back offices. It is launched under Apache v2.0 License. Ralph allows you to preserve track of Assets purchases and control the complete property life cyle, each within the office and Data Center. So, in this tutorial we will cover the installation and configuration of Ralph Asset Management System on Ubuntu 18.04. Just follow the below steps."},
{"url": "https://www.osradar.com/install-sentrifugo-hms-on-ubuntu-18-04/", "title": "How to install Sentrifugo on Ubuntu 18.04?", "paragraph": "Employees are the heart of an organization and it is necessary to have an application capable of managing all the processes pertaining to this area. So, that’s why in this article you can learn how to install Sentrifugo HRMS in Ubuntu 18.04?"},
{"url": "https://www.osradar.com/install-sqlite-on-opensuse-15-2-15-1/", "title": "How to install SQLite on OpenSUSE 15.2 / 15.1?", "paragraph": "There are many good database management systems, but they are not all the same. And the fact that they are not, means that we have to choose which one suits our needs best. For example, MySQL and MariaDB are very powerful but they are managed on a service basis. This doesn’t make them recommendable for portable applications. However, there is another player that is SQLite. So today I’m going to show you how to install SQLite on OpenSUSE 15.2 / 15.1."},
{"url": "https://www.osradar.com/install-nextcloud-centos-8-rhel-8-oracle-linux-8/", "title": "Install Nextcloud on CentOS 8 /RHEL 8 / Oracle Linux 8", "paragraph": "Nextcloud is a very useful application that allows us to create a private cloud. Thanks to it, any company can create a server dedicated to its data. So you will have absolute control of them. This is important because privacy and file security are currently highly valued. But it is also quite useful if we have a personal server and we want to have our data backed up without having to entrust our data to third parties. Anyway, in this post, you will learn to install Nextcloud on CentOS 8 / RHEL 8."},
{"url": "https://www.osradar.com/install-phpmyadmin-debian/", "title": "How to install PHPMyAdmin on Debian 11", "paragraph": "phpMyAdmin is a free software tool written in PHP, intended to handle the administration of MySQL over the Web. phpMyAdmin supports a wide range of operations on MySQL and MariaDB. Frequently used operations (managing databases, tables, columns, columns, relations, indexes, users, permissions, etc) can be performed via the user interface, while you still can directly execute any SQL statement."},
{"url": "https://www.osradar.com/install-the-latest-version-sqlite-ubuntu-20-04/", "title": "How to install the latest version of SQLite on Ubuntu 20.04?", "paragraph": "From the SQLite website, they boast that it is the most used database manager in the world. So in this post, you will learn how to install the latest version of SQLite on Ubuntu 20.04"},
{"url": "https://www.osradar.com/installing-tuleap-on-centos-7-a-wonderfull-project-management/", "title": "Installing Tuleap on CentOS 7. A Wonderfull Project management", "paragraph": "This is because the software becomes more difficult to maintain and reimplement, forcing developers to find alternatives to manage the project itself, thus maintaining a workflow according to the needs that arise."},
{"url": "https://www.osradar.com/set-a-static-ip-address-ubuntu-20-04/", "title": "How to set a Static IP address on Ubuntu 20.04?", "paragraph": "A server usually always has a static IP address that facilitates the rest of the network services. So although it is not mandatory if it is of great help for the management of the server. So this post is about how to define a static IP address in Ubuntu 20.04"},
{"url": "https://www.osradar.com/the-5-best-hardware-info-tool-on-linux/", "title": "The 5 Best Hardware Info Tool on Linux", "paragraph": "On Linux, learning about your system hardware can be tough sometimes. Don’t worry; there are a number of available tools to get you a full specification of your current system. We’ve already discussed Superfetch and Neofetch, two Linux tools for finding out the basic system specs. However, they don’t provide any advanced info that you may need to know in various cases."},
{"url": "https://www.osradar.com/tableplus-tool-database-management/", "title": "TablePlus a modern tool for databases management", "paragraph": "Tools to work with databases there are many. However, many of them specialize in certain database handlers, for example, PHPMyAdmin only focuses on MySQL / MariaDB. Today, I will tell you about TablePlus which is presented to us as a modern and native database management tool.  I will also show you how to install it in Ubuntu 18.04."},
{"url": "https://www.osradar.com/install-python-3-9-ubuntu-20-04-18-04/", "title": "Install Python 3.9 on Ubuntu 20.04 / 18.04", "paragraph": "Python is one of the most popular programming languages out there. Its incredible versatility makes it be in almost any technology field. In addition, its learning curve is quite low which makes it ideal for learning."},
{"url": "https://www.osradar.com/letsupload-offers-100-gb-of-free-cloud-storage/", "title": "LetsUpload offers 100 GB of free cloud storage.", "paragraph": "Cloud storage is an increasingly popular option for Internet users. Indeed, there are many platforms that offer this service. It allows you to host various content and have it always available. In addition, it makes it possible to make backups and open files from any location. Well, today we will talk about an interesting option: LetsUpload that offers up to 100 GB of free cloud storage."},
{"url": "https://www.osradar.com/what-are-fbx-files-and-why-are-they-important-for-3d-design/", "title": "What are FBX files and why are they important for 3D design.", "paragraph": "On our Windows computer, we use all kinds of files regularly. Indeed, many of us are familiar with them, as we work with them daily. Therefore, we know what to do with them and how to open them. However, at other times we may come across files that we have never worked with before. Moreover, we are not familiar with them and do not know how to deal it. This may be the case with FBX files, which we are going to talk about today. On the other hand, the world of 3D design is a sector that has been growing exponentially over the years. This applies to both hardware and software. Consequently, there are many programs that can handle these three-dimensional files. In this specific case we refer to FBX files. These elements allow us to work in a shared and simultaneous way between several 3D content creation applications."},
{"url": "https://www.osradar.com/what-is-eco-mode-and-how-to-activate-it-in-windows-10/", "title": "What is ECO mode and how to activate it in Windows 10", "paragraph": "Hello! Windows is preparing an interesting new feature to improve system performance. In addition to preserving battery life and reduce overheating of the device. Next, we will see what is the Eco Mode and how to activate it. We have talked about the next big update of Windows 10, called Windows Sun Valley. Well, this update incorporates a hidden surprise. Indeed, the ECO mode is called to improve the performance of the computer. Additionally, it will be hidden in the task manager ready to be activated. Stay with us to find out what ECO mode is and how to activate it in Windows 10."},
{"url": "https://www.osradar.com/what-is-the-runtime-broker-process-in-windows-11/", "title": "What is the Runtime Broker process in Windows 11.", "paragraph": "Hello! You have probably noticed the Runtime Broker in Windows 11 at some point. Specifically, when visiting the list of processes offered by the Task Manager. Actually, it is sometimes nested within an application’s own tasks. Other times, though, it appears as a standalone task. Some say it is a feature that consumes CPU and RAM unnecessarily. But what is it really all about? Today we will see what Runtime Broker is and what it is used for. We will show you all the details of a process that, as you will see, is very necessary to protect your privacy and the data you store on your computer. Let’s get started!"},
{"url": "https://www.osradar.com/write-multiple-usb-flash-drives-with-gnome-multi-writer/", "title": "Write Multiple USB Flash Drives with GNOME-multi-writer", "paragraph": "USB drives are one of the best ways to travel with your favorite movies and personal files without carrying the large laptop or other components. Of course, there are pocket PCs available in the market but not all of us use those on a regular basis."},
{"url": "https://www.osradar.com/your-torrent-center-deluge-web/", "title": "How to set your torrent center with Deluge Web?", "paragraph": "Imagine you have a server and you want to download your files via torrent and accessible from anywhere. This is why it is possible to use and configure Deluge in such a way that you can connect without problems and manage your torrents"},
{"url": "https://www.osradar.com/new-xiaomi-gallery-tips-and-tricks/", "title": "New Xiaomi Gallery: Tips and Tricks", "paragraph": "Hello friends! Recently with the arrival of MIUI 13, Xiaomi has slightly remodeled the Gallery of their devices. This app has several options and features, to perform different tasks, which make it a more complete app. Many of these new features are somewhat hidden. Since they are not found in the conventional editing menu. Among these new features, you will find some like the ability to add a watermark, make perspective cropping, and smart filters. Therefore, in this post, we will show you some tips and tricks of the new Xiaomi gallery."},
{"url": "https://www.osradar.com/arangodb-using-docker-compose/", "title": "How to deploy ArangoDB using Docker Compose?", "paragraph": "Briefly, I will tell you that Docker compose is more thought of production environments where compatibility should be as high as possible. This is precisely the great advantage of Docker images that we will be able to use in any supported system thanks to the technology of containers. Then, these steps can be done from any Linux distribution that has installed Docker and Docker Compose."},
{"url": "https://www.osradar.com/best-codecs-for-windows-11/", "title": "Best codecs for Windows 11", "paragraph": "Today we are going to show you the best codecs for Windows 11 that you can download to your computer. However, first, it is important to clarify the meaning of codecs. The term codec is an acronym of two words: encoder and decoder. Basically, it is a software that is responsible for encoding or decoding a signal or a digital data stream. Although this function can also be performed by hardware as well. Therefore, codecs are not only for media playback. That is only part of their function, that of decoding. They also work in the reverse direction, i.e., transforming and encoding the signal. On the other hand, it is significant not to confuse them with the file format. Indeed, the same type of file can be encoded using different methodologies, i.e., with different codecs. Read on to learn more about the best codecs for Windows 11."},
{"url": "https://www.osradar.com/category/security/", "title": "Security", "paragraph": ""},
{"url": "https://www.osradar.com/4-steps-to-remove-malware-from-your-pc/", "title": "4 steps to remove malware from your PC", "paragraph": "Imagine this scenario: your computer is running slower than usual or the operating system is displaying random errors. It may happen that your web browser freezes, struggling to get rid of strange advertisements. You may even be unable to access your documents. As a result, you are likely to suffer from a digital infection that prevents the regular use of your computer. In addition, it is likely to put your data, files, and perhaps something else at risk. For example, passwords and access to digital banking. It is best to be able to have options to remove malware."},
{"url": "https://www.osradar.com/change-the-default-terminal-emulator-on-linux/", "title": "Change the Default Terminal Emulator on Linux", "paragraph": "Terminal is the heart and soul of any Linux system. Using it, you can perform all the complex and difficult tasks. All you need is a proper understanding of the commands you’re giving input and decipher what the output means."},
{"url": "https://www.osradar.com/what-is-kernel-hacking/", "title": "What is kernel hacking?", "paragraph": "Hacking is a really complicated stuff to most of the people. The term “kernel hacking” might feel like a really complicated stuff as well, but it isn’t. Let’s dissect kernel hacking and if interested, how to be a “kernel hacker”."},
{"url": "https://www.osradar.com/5-websites-for-drawing-with-artificial-intelligence/", "title": "5 websites for drawing with artificial intelligence", "paragraph": "Artificial Intelligence (AI) has gradually become available to the public. Certainly, there are projects still closed to a few, such as Google’s Image Video or Google’s Parti. However, many others have opened up and allow us to perform wonders in a very simple way. Let’s take a look at the most outstanding tools you can find online right now. From there you can make drawings online in a very simple way with Artificial Intelligence. As we will see, each AI has a particular style. Therefore, it is difficult to say at first glance which one is better or worse. Next we will see 5 websites for drawing with artificial intelligence."},
{"url": "https://www.osradar.com/configuring-open-vswitch-on-centos-rhel-fedora/", "title": "Configuring Open vSwitch on CentOS | RHEL | Fedora", "paragraph": "Today we are going to learn that how to configure Open vSwitch on CentOS/RHEL. In our previous lecture you’ve learned that how to install Open vSwitch on CentOS/RHEL. If you missed the previous article simply click the below link to read it first for the installation of Open vSwitch on CentOS/RHEL."},
{"url": "https://www.osradar.com/category/desktop/", "title": "Desktop", "paragraph": ""},
{"url": "https://www-osradar-com.translate.goog/how-to-use-the-xiaomi-browser-to-download-videos-from-twitter-instagram-and-facebook/?_x_tr_sl=en&_x_tr_tl=id&_x_tr_hl=id&_x_tr_pto=tc", "title": "How to use the Xiaomi browser to download videos from Twitter, Instagram, and Facebook!", "paragraph": "Hello folks! Each of the operating systems has its hidden tricks. For us users to get more out of the phone. , Xiaomi knows a lot because MIUI is a mobile interface with a lot of settings. That we can do so much to make the phone work more efficiently to get more out of the phone. And it is something that is maintained in MIUI 14. Now, there is a trick that is not secret or hidden. It’s the ability to use the Xiaomi browser to download videos from Twitter, Instagram, and Facebook. Even up to WhatsApp statuses. It’s relatively simple and that’s why in this post we tell you how you can do it with any Android phone."},
{"url": "https://www.osradar.com/customize-keyboard-shortcuts-on-cinnamon/", "title": "Customize Keyboard Shortcuts on Cinnamon", "paragraph": "Cinnamon desktop is one of the finest desktop environments for Linux distros. By default, it’s the part of the Linux Mint distro. However, because of its simplicity, lower resource consumption, and good look, the awesome desktop environment is available on almost all the major Linux distros!"},
{"url": "https://www.osradar.com/dbgate-database-client/", "title": "DbGate: The Smartest (no)SQL Database Client", "paragraph": "Hello, friends. We already know that developers or people who are in charge of a database, require professional clients to facilitate their task. So, in this post, we will introduce you to DbGate which is another client that supports many database managers."},
{"url": "https://www.osradar.com/dynamic-host-configuration-protocol-dhcp-is-a-network-protocol-used-in-internet-protocol-ip-networks-the-server-that-supports-the-protocol-is-called-a-dhcp-server/", "title": "Install and configure DHCP in Windows Server 2019 Step By Step", "paragraph": "Dynamic Host Configuration Protocol (DHCP) is a network protocol used in Internet Protocol (IP) networks. The server that supports the protocol is called a DHCP server. As its name indicates, DHCP is a service that provides TCP/IP settings, such as IP address, subnet mask, default gateway, and DNS server to the clients, automatically.For this tutorial, I will be using my domain controller named as WS2K19-DC01 that is configured with 172.18.72.5/24 IP address and hosts the Active Directory Domain Service role for the mylab.local domain. We have one more Windows 10 virtual machine to test the DHCP server functionality.  "},
{"url": "https://www.osradar.com/firefox-developer-edition-on-linux/", "title": "Firefox Developer Edition on Linux", "paragraph": "Firefox offers a powerful platform for the web. Developed and maintained by Mozilla, Firefox is one of the finest open-source web browsers that comes with a simple interface and support for tons of extensions."},
{"url": "https://www.osradar.com/configuration-example-for-qos-dscp-on-windows-server-2016/", "title": "Configuration Example for QoS DSCP on Windows Server 2016", "paragraph": "You can use QoS Policy as a central point of network bandwidth management across your entire Active Directory infrastructure by creating QoS profiles, whose settings are distributed with Group Policy. QoS traffic management occurs below the application layer, which means that your existing applications do not need to be modified to benefit from the advantages that are provided by QoS policies. "},
{"url": "https://www.osradar.com/foremost-is-a-great-tool-for-recover-files-on-linux/", "title": "Foremost is a great tool for recover files on Linux", "paragraph": "Linux has fantastic tools that we can apply to our daily work. Whether you work on a server or simply on your personal computer. Sometimes at work, we can make several mistakes when working with files. For example, delete a file we should not have. Or format a flash drive that contains important information that we then need. That’s why today I will show you how to install and use Foremost an extraordinary tool to recover files on Linux."},
{"url": "https://www.osradar.com/elasticsearch-dsl-query-examples/", "title": "Elasticsearch DSL Query Examples", "paragraph": "9200/tcp is one of the network communication socket that Elasticsearch use. And when running, Elasticsearch expose its REST API on this port for external communication and that is what we can connect with to perform these DSL queries. This API is build on top of HTTP protocol, so its aware any http calls, for example, GET, POST, PUT.."},
{"url": "https://www.osradar.com/how-to-access-the-hidden-menus-of-nova-launcher/", "title": "How to access the hidden menus of Nova Launcher", "paragraph": "Hello friends! Nova Launcher is one of the best Launcher for Android devices. For many years it has established itself as one of the alternatives to the default launcher included in Android phones. Nova Launcher is one of the most complete and versatile, with a large number of options, some more visible than others. It hides two secret menus or, at least, is not accessible at first glance. Therefore, in this post, we will show you how to access the hidden menus of Nova Launcher."},
{"url": "https://www.osradar.com/how-to-activate-the-do-not-disturb-mode-in-whatsapp/", "title": "How to activate the do not disturb mode in WhatsApp", "paragraph": "Hello friends! Many times we want to turn off notifications from certain messaging apps for a while. Either because we want to take a break from certain areas of our life or because we are busy with something. One of the top messaging apps around the world is WhatsApp. The only problem is that WhatsApp does not have a do not disturb mode or at least not currently. However, there are some settings we can make to achieve this. In this post, we will show you how to activate the do not disturb mode in WhatsApp. Although this application does not have this mode. We will show you how to set up WhatsApp for those moments when you need some quiet. The best part is that only you can notice it. And it’s completely reversible if you want to leave it as it was initially."},
{"url": "https://www.osradar.com/how-to-backup-firefox-profile-on-linux/", "title": "How to Backup Firefox Profile on Linux", "paragraph": "Firefox is another well-known and popular browser of choice for everyone on the internet. Developed and maintained by Mozilla, Firefox is well-known for its security and performance. Firefox is especially favorable to those who love the open-source nature, freedom of software & open internet. There are hardly any computer users in the world who doesn’t know the name Firefox at all."},
{"url": "https://www.osradar.com/how-to-change-password-local-administrator-or-domain-in-windows-server-powershell-via/", "title": "How to change password Local Administrator or Domain in Windows Server (PowerShell Via)", "paragraph": "Hello! The use of a password is a common mechanism to increase security on Windows Server. Of course, this password must meet certain security parameters to be secure. Additionally, after some time it is likely that you will want to change it. Indeed, these changes can be implemented to the local or domain administrator. Additionally, a correctly configured password makes it more difficult to compromise the security of the server. However, there comes a time when it is advisable to modify these values. For this reason, today we will see how to do it using the Windows Server PowerShell. Come with me to see how to change password Local Administrator or Domain in Windows Server (PowerShell Via)"},
{"url": "https://www.osradar.com/how-to-check-detect-fake-usb-devices/", "title": "How to Check/Detect Fake USB Devices", "paragraph": "In the present world of the computer, USB storage devices are one of the most widely used gadgets for all sorts of purposes. Sharing files, installing OS etc. are the prime usages of USB devices. Moreover, USB devices are quite popular in the market. There are many brands who have earned a pretty good fame for serving quality products to the consumers."},
{"url": "https://www.osradar.com/how-to-compress-and-decompress-files-in-android/", "title": "How to compress and decompress files in Android", "paragraph": "Hi, how are you? This time we’ll talk a little bit about Android. It is well known that this is the most used mobile operating system worldwide. Similarly, a smartphone is used for multiple daily tasks. One of them is file management. In fact, the exchange of information through the Internet or social networks is a very common activity. Consequently, many users download and send files in different formats. Sometimes, these files are compressed. On a computer, handling these files is not a major problem. However, perhaps you didn’t know that in Android it is possible to manage them natively. For that reason, I show you how to compress and decompress files in Android."},
{"url": "https://www.osradar.com/how-to-enable-or-disable-netbios-over-tcpip-windows-10/", "title": "How to enable or disable NetBIOS over TCPIP Windows 10", "paragraph": "Windows 10 has several protocols. Which are designed to make your plugins work in a correct way. Indeed, one of these protocols is NetBios. Network Basic Input/Output System is a protocol that allows applications on different computers to communicate with each other on a local network. This protocol should be enabled by default in Windows 10. And its mission is to allow the sharing of network resources. In addition to initiating and maintain open network sessions. Therefore, today we will see how to enable and disable NetBIOS over TCPIP in Windows 10."},
{"url": "https://www.osradar.com/how-to-create-centos-8-local-repository-mirrors-with-rsync-nginx/", "title": "How To Create CentOS 8 Local Repository Mirrors With Rsync & Nginx", "paragraph": "Today, we are going to create CentOS 8 Local Repository Mirrors on our CentOS 8 with the help of Rsync & Nginx. We can create by Local cron jobs through which we can checks for updates in the upstream repositories & update them locally accordingly."},
{"url": "https://www.osradar.com/how-to-deploy-a-lamp-server-using-docker-compose/", "title": "How to deploy a LAMP server using Docker-Compose?", "paragraph": "Recently we talked to you about installing Docker on Debian 10 Buster. Docker is a technology to display container images that allows you to install applications without worrying about dependencies. In this opportunity, we will deploy a LAMP server using docker-compose."},
{"url": "https://www.osradar.com/how-to-encrypt-home-folder-in-linux/", "title": "How to Encrypt Home Folder in Linux", "paragraph": "If you’re on Linux, you already have the idea of the security level of this awesome operating system. This has set up all the systems in such a manner that until you give the permission, there’s hardly any malware to run into your system. However, despite the security, your data isn’t completely secured. Those who have physical access to your system can easily extract your sensitive data."},
{"url": "https://www.osradar.com/how-to-fully-customize-windows-10/", "title": "How to fully customize Windows 10", "paragraph": "I must confess that I love to change the look of Windows 10. In fact, I always try to change the wallpaper or change the theme. However, if you are like me, you will know that this process is not always easy. Especially if you try to change the icons or add a widget. And if you try to install a third-party theme, then the situation gets worse. Since it often involves patching Windows files. Which generates resistance from some users. Consequently, today we will see a different way. Because we will use a tool that allows us to customize Windows 10 completely. We are talking about ScreenStyler. A free app that is still in the beta phase but promises a lot."},
{"url": "https://www.osradar.com/how-to-install-an-ssh-client-and-server-in-windows-10/", "title": "How to install an SSH client and server in Windows 10.", "paragraph": "Hello, how are you? In the previous article, we saw how to enable Telnet in Windows Server. This protocol is very useful, but it has a serious security breach. For that reason, we recommend using the SSH connection. It is a remote administration protocol that allows users to control and modify their remote servers over the Internet. To do this, it uses an authentication mechanism. The protocol works by authenticating a remote user and transferring inputs from the client to the host. It then retransmits the output back to the client. But most importantly, the communication is delivered encrypted so the security is much higher than Telnet. In view of the above, let’s see how to install an SSH client and server in Windows 10."},
{"url": "https://www.osradar.com/how-to-install-feng-office-on-a-web-server/", "title": "How to install Feng Office on a web server", "paragraph": "Hello! We continue to explore the world of web development. Specifically, the additions we can make to a web server. This time, we’ll talk a little about Feng Office. This is a project and team management web application. It also allows you to edit, share, and publish documents, emails, and calendars. Similarly, it is aimed at improving the productivity of the group with web document management and CRM. It is based on PHP and MySQL. As you can see, it has very interesting features. So let’s see how to install Feng Office on a web server."},
{"url": "https://www.osradar.com/how-to-install-java-on-ubuntu-20-04/", "title": "How To Install Java on Ubuntu 20.04", "paragraph": "Today we are going to learn that how to install Java on Ubuntu 20.04. Before going to the Java installation let’s have a short introduction about it. Java is the most popular and interesting language used for programming, gaming and developing  different tools. Most developers prefer Java to build Java based applications. Just follow the below steps for an easy installation."},
{"url": "https://www.osradar.com/how-to-install-iis-on-windows-server-2019-2016/", "title": "How to install IIS on Windows Server 2019/2016", "paragraph": "Hi! Today we will continue to talk about Windows Server. It is well known that its use in a corporate environment is a practical alternative. Since it allows centralizing roles, functions, and services inherent to users and computers. Additionally, Windows Server allows adding extra functionalities. These additions increase the functionality of the company and maximize the power of the server. Specifically, we will study Internet Information Services (IIS). This service, also known as Windows Web Server can be added to Windows Server 2019 or 2016. So you can host web applications. In addition, this technology incorporates important improvements. For example, it reduces the surface of the web attack and improves the overall performance of the server. Also, it allows the construction and development of customized servers. For that reason, today we will see how to install IIS on Windows Server 2019/2016."},
{"url": "https://www.osradar.com/how-to-install-lighttpd-web-server-on-ubuntu-18-04/", "title": "How to install lighttpd web server on Ubuntu 18.04?", "paragraph": "On this site, we have talked a lot about web servers as it is a very popular topic in the development of current applications. In addition, configuring them is a delicate and vital task for an organization. On the other hand, you have to be efficient in the management of computer resources, so today I will show you how to install Lighttpd in Ubuntu 18.04."},
{"url": "https://www.osradar.com/how-to-install-java-freebsd-12/", "title": "How to install Java on FreeBSD 12?", "paragraph": "In the image we can see that there are several versions of Java available, but only version 8 contains both JDK and JRE. Therefore, this is the version that we will install."},
{"url": "https://www.osradar.com/how-to-install-lighttpd-freebsd-12/", "title": "How to install lighttpd on FreeBSD 12?", "paragraph": "Hi, folks. Thanks for staying another day. In this post, you will learn how to install Lighttpd on FreeBSD 12. Of course, we will include PHP support. So let’s go for it."},
{"url": "https://www.osradar.com/how-to-create-your-whatsapp-stickers-pack/", "title": "How to create your WhatsApp Stickers pack", "paragraph": "Hello friends! WhatsApp Stickers is one of the best features that were introduced, which came to stay and is currently one of the most used. The normal thing is that you save the Stickers that your contacts usually send you. But it is possible to make your personalized Stickers, using any photo you have taken with your phone’s camera. You can also create Stickers from images you download from the internet. And you can even make several Stickers and create your pack for easier access to them. It’s a relatively simple process that won’t take you much time. In this post, we will show you how to create your WhatsApp Sticker pack."},
{"url": "https://www.osradar.com/how-to-install-moodle-with-ubuntu-20-04-lts/", "title": "How to install Moodle with Ubuntu 20.04 LTS.", "paragraph": "The COVID pandemic situation is worldwide, educators are facing a challenge to provide online education. Though there are lots of TMS (Teaching management Systems) available in the market, either they are costly or complicated to deploy and manage. Moodle is here to get rid of all of the challenges. How to install Moodle with Ubuntu 20.04 LTS."},
{"url": "https://www.osradar.com/how-to-play-pokemon-infinite-fusion-on-android/", "title": "How to play Pokemon Infinite Fusion on Android", "paragraph": "Pokemon Infinite Fusion is a unique fan-created game that takes the exciting Pokemon universe to a whole new level. The game is the result of the creative genius of the players, allowing you to combine two different Pokémon into one, creating almost limitless possibilities. Although the game was originally designed for the PC, it can also be played on an Android device if you work a little harder. In this article, we’ll walk you through the steps necessary to play Pokemon Infinite Fusion on your Android device."},
{"url": "https://www.osradar.com/how-to-install-pydio-on-centos-7/", "title": "How to install Pydio on CentOS 7?", "paragraph": "Data is essential in a company. Luckily, there are open source tools that allow us to create our own data servers in the best Dropbox or Google Drive style. Among them we have Owncloud or Nextcloud, but there is an alternative to them that puts more focus on companies. With this in mind, today I will teach you how to install Pydio on CentOS 7."},
{"url": "https://www.osradar.com/how-to-install-webmin-on-centos-8-rhel-8-oracle-linux-8/", "title": "How to install Webmin on CentOS 8 / RHEL 8 / Oracle Linux 8?", "paragraph": "Monitoring a computer is always necessary to verify its operation.  Especially if we are talking about a computer connected to an internal network. So, installing a tool with some computer tasks is always a good idea. Therefore, in this post, I will show you how to install Webmin on CentOS 8. This tutorial will also work on RHEL 8 and Oracle Linux 8."},
{"url": "https://www.osradar.com/how-to-prevent-songs-from-repeating-in-spotify/", "title": "How to prevent songs from repeating in Spotify", "paragraph": "Hello friends! The algorithm used by Spotify for shuffle playback uses a feature. Which tends to play the same song over and over again. Luckily there is a trick to fix this and be able to play more songs in your playlists. Spotify updated support for Android 13 recently to go hand in hand with all the improvements made with this major update. Of all the possibilities offered by the service, random playlists have a small drawback that can be corrected with this cool trick. In this post, we’ll show you how to prevent songs from repeating in Spotify."},
{"url": "https://www.osradar.com/how-to-install-git-on-windows-11/", "title": "How to install Git on Windows 11", "paragraph": "Hello! The arrival of Windows 11 is a recent development. For this reason, we are just getting to know its possibilities and potentialities. In fact, it is a system that allows the installation of several applications focused on increasing the productivity of the system. Well, one of these apps is Git. With it, we will be able to make a better control of the files and their source codes. Consequently, it enables a better control of the different versions. Git has been developed as a distributed and scalable revision control system. It is also integrated with a set of commands to make working in Windows 11 much more comprehensive. Git works as an open source distributed version control system. Therefore, it facilitates the management of projects of any size. Read on to learn how to install Git on Windows 11."},
{"url": "https://www.osradar.com/how-to-use-the-ss-command/", "title": "How to use the ss command", "paragraph": "For Linux users, there will come a time when you need to know about the network. Several tools help in this process, but one is more complicated than the other. The ss command is reliable for installing on multiple computers."},
{"url": "https://www.osradar.com/how-to-recover-corrupted-root-partition-rescue-mode-centos-rhel/", "title": "How to Recover Corrupted Partition using Rescue Mode in CentOS/RHEL", "paragraph": "The root partition is the core of every Linux system’s heart. This is the place where the operating system is stored. This is also the place where every single app are installed and important operations are performed. That’s why it’s really important that no data corruption happens to this part of the hard drive."},
{"url": "https://www.osradar.com/how-to-setup-a-mail-server-on-ubuntu-18-04/", "title": "How to setup a mail server on Ubuntu 18.04?", "paragraph": "The email did not need too much presentation as we all sent and received one. There are companies that provide us with the Email service and that is more than enough for the vast majority of users, but there is the possibility of having one on our own server."},
{"url": "https://www.osradar.com/how-to-use-sar-in-linux/", "title": "How to use SAR in Linux", "paragraph": "System Activity Report (SAR) is a Unix System monitor command used to report on various system loads. So it including CPU activity, memory/paging, interrupts, device load, network and swap space utilization. Sar uses /procfilesystem to collect information. However, It is very easy to install and it is available package on many distributions."},
{"url": "https://www.osradar.com/install-apache-web-server-php-debian-linux/", "title": "Install Apache web server on Debian 11", "paragraph": "Hello folks. With Debian 11 ready for download then the process of supporting it begins. So, in this short post, you will learn how to install Apache web server on Debian 11."},
{"url": "https://www.osradar.com/how-to-install-ruby-on-rails-on-ubuntu-20-04/", "title": "How To Install Ruby On Rails On Ubuntu 20.04", "paragraph": "In this tutorial you’ll learn that how to install Ruby On Rails On Ubuntu 20.04. Ruby On Rails also called Rails(simple form) is an open source platform that can be used to create high performance & powerful websites as well as applications. So, here we’ll see that how we can install it on our Ubuntu 20.04 system."},
{"url": "https://www.osradar.com/install-laravel-php-framework-opensuse-15/", "title": "How to install Laravel PHP Framework on OpenSUSE 15?", "paragraph": "OpenSUSE is a Linux distribution, sponsored by SUSE. It is a great new distribution, stable and with outstanding tools like Yast. That’s why more and more developers are using it as their main system, which indicates its broad functionality. So, I will teach you how to install Laravel PHP Framework on OpenSUSE 15."},
{"url": "https://www.osradar.com/install-mantis-bug-tracker-debian-10/", "title": "How to install Mantis Bug Tracker on Debian 10?", "paragraph": "If you are a developer you know that bugs are always present in the process of building a program. Especially if we work as a team on certain projects. Therefore, it is necessary to have software that can distribute the workflow of the project or simply track these problems. That is why today I will show you how to install Mantis Bug tracker on Debian 10."},
{"url": "https://www.osradar.com/install-mariadb-database-debian/", "title": "Install MariaDB on Debian 11", "paragraph": "Hello, friends. It is not yet known for sure which is the most used database driver, but MariaDB has to be in the first place. So, in this post, you will learn how to install MariaDB on Debian 11. This step is essential if you want to have applications running on your system."},
{"url": "https://www.osradar.com/install-nim-programming-language-freebsd-12/", "title": "How to install Nim programming language on FreeBSD 12?", "paragraph": "Nowadays, almost everything is done with the help of a computer and a program. And the programs are made through a programming language. That is why it must be efficient languages with new technical features that can be brought to the program and the end-user. Today we will teach you how to install Nim programming language on FreeBSD 12. "},
{"url": "https://www.osradar.com/install-polr-ubuntu/", "title": "Install Polr on Ubuntu 20.04", "paragraph": "Polr is a quick, modern, and open-source link shortener. It allows you to host your own URL shortener, to brand your URLs, and to gain control over your data. It’s also GPLv2+ licensed."},
{"url": "https://www.osradar.com/install-prestashop-ubuntu-20-04/", "title": "How to install Prestashop on Ubuntu 20.04?", "paragraph": "If there’s one thing the Internet has revolutionized, it’s commerce. Now almost any store needs a website to offer its products and services, but it also needs to be able to function as an online store where you can purchase right there. This is why I taught you how to install Prestashop on Ubuntu 20.04. Because Prestashop allows you to deploy an online store in a very comfortable way."},
{"url": "https://www.osradar.com/install-java-15-opensuse-15-2/", "title": "How to install Java 15 on OpenSUSE 15.2?", "paragraph": "Recently Java 15 has been released with interesting new features in the accounting field and introducing many security patches. In spite of this, it can now be installed in Linux either as compiled packages or by downloading the binaries. Well, in this post, I will show you how to install Java 15 on OpenSUSE 15.2 / 15.1."},
{"url": "https://www.osradar.com/install-protonvpn-debian-10/", "title": "How to install ProtonVPN on Debian 10?", "paragraph": "Using a VPN is a good way to maintain our online safety. Of course, trust in the provider of that VPN is the key to knowing whether or not we should use it. So, in this post, you will learn how to install ProtonVPN on Debian 10."},
{"url": "https://www.osradar.com/install-sensu-go-monitoring-tool-ubuntu/", "title": "How to install Sensu GO monitoring tool on Ubuntu 20.04?", "paragraph": "Hello, friends. In this post, you will learn how to install Sensu Go Monitoring Tool on Ubuntu 20.04. With this complete tool you can monitor nodes in your network and at the same time check the health of some applications."},
{"url": "https://www.osradar.com/install-vanilla-forum-on-ubuntu-18-04/", "title": "Install Vanilla Forum on Ubuntu 18.04", "paragraph": "Vanilla is an opensoure discussion forum  the installation is also very easy. please follow the steps to get an successful vanilla forum installation. maybe your  need some per-installed packages  to avoide any issues"},
{"url": "https://www.osradar.com/install-wekan-debian-10-9/", "title": "How to install Wekan in Debian 10 / Debian 9", "paragraph": "Let’s be honest, when we hear or read that an application is for free, we immediately have doubts: if the application is good or just a waste of time using it. In this case, we have a productivity-oriented program that can be implemented in mid-sized workgroups. We will talk about Wekan and learn how to install it in Debian 10 / Debian 9."},
{"url": "https://www.osradar.com/install-openh264-fedora-33/", "title": "How to install OpenH264 on Fedora 33?", "paragraph": "Hello, friends. In this short post, you will learn how to install OpenH264 on Fedora 33. You will find this post especially useful if you use your web browser a lot to play video files from the Internet."},
{"url": "https://www.osradar.com/install-wordpress-debian-10/?fbclid=IwAR2Hpocnk9LP4a4UzpEwsiLty8_Rbbm5l84d9SOBgLC1dSZhqSgYincjJss", "title": "How to install WordPress on Debian 10?", "paragraph": "In today’s world, everything is Internet and information sites. There is too much variety in them. But we also find a lot of variety of applications that allow us to make websites. In this way, we find a nice CMS competition. That is to say, web applications that allow creating a blog without much effort. Of all these, WordPress is the most popular and solvent of all. That’s why, in this post, you will learn how to install WordPress on Debian 10, Buster."},
{"url": "https://www.osradar.com/monitoring-linux-system-with-ytop/", "title": "Monitoring Linux system with ytop", "paragraph": "Monitoring the resources of a computer in Linux helps to know which programs require special attention. It also allows you to know what is the performance of your computer according to various circumstances."},
{"url": "https://www.osradar.com/monitoring-wifi-with-wavemon/", "title": "Monitoring WiFi with Wavemon", "paragraph": "Although Linux is a pretty secure and flexible system, the truth is that by default it does not have a tool to monitor our wifi hardware. That is why in this post I will talk about a tool to do it called Wavemon: a wonderfull tool to monitoring wifi."},
{"url": "https://www.osradar.com/install-mantis-bug-tracker-ubuntu-20-04/", "title": "How to install Mantis Bug Tracker on Ubuntu 20.04?", "paragraph": "If you are a developer you know that bugs are always present in the process of building a program. Especially if we work as a team on certain projects. Therefore, it is necessary to have software that can distribute the workflow of the project or simply track these problems."},
{"url": "https://www.osradar.com/translate-your-texts-using-crow-translate/", "title": "Translate your texts in Linux using Crow Translate", "paragraph": "Many times we miss many that Linux does not have the same amount of applications as Windows or MacOS. Recently, thanks to Electron, we find more and more cross-platform applications like Atom, just to mention one. However, there are also other applications not so complex but that provide variety and solutions to the Linux environment. And in this sense, they replace the always having to use the web browser for everything. Even to translate a document, you would have to use the web browser, but today I will tell you how to translate your texts in Linux with Crow Translate."},
{"url": "https://www.osradar.com/4-tricks-to-stop-google-discover-from-showing-you-news-youre-not-interested-in/", "title": "4 tricks to stop Google Discover from showing you news you’re not interested in", "paragraph": "Hello friends! It is possible to customize Google Discover to only show you news and articles that interest you and skip the topics you don’t want to see. Google Discover is that page that shows you news on the left page of your desktop. As well as in the Google application itself. You can also customize what it shows you to suit your tastes. The algorithm doesn’t always get it right, that’s for sure, but luckily you can help Google. So it can improve and show you news on topics that interest you and omit what you don’t like. These tricks are ideal, for example, if you want Google Discover news to focus on movies, technology, mobile, or politics. Since it will make the recommendations better. So, in this post, we will show you 4 tricks to stop Google Discover from showing you news you are not interested in."},
{"url": "https://www.osradar.com/two-ways-to-install-nodejs-debian-10-buster/", "title": "Two ways to install NodeJS on Debian 10 Buster?", "paragraph": "Debian 10 Buster is one of the best operating systems for application development. And in fact almost any kind, including the web. In this sense, you have the possibility to install enough tools to improve the power of these applications. Among them NodeJS. If you are a web developer or are just starting, you will love this post, because you will learn two ways to install NodeJS on Debian 10, Buster."},
{"url": "https://www.osradar.com/what-is-wi-fi-bonding-and-how-does-it-improve-your-connection/", "title": "What is Wi-Fi bonding, and how does it improve your connection?", "paragraph": "Today we will learn what Wi-Fi bonding, or simply bonding, means. Indeed, this is the sum of two or more networks that, together, allow reaching higher Internet speeds. For a moment, think of a single Wi-Fi network. In this case, the speed will depend on factors such as the location, the access point, the network card we use. As a result, we can sometimes have a better connection with the cell phone browsing with mobile data than over the wireless network. So, it would be a good idea to merge both networks. So, today we will know What is Wi-Fi bonding, and how does it improve your connection?"},
{"url": "https://www.osradar.com/9-things-you-can-do-with-the-new-bing-search-engine-with-integrated-chatgpt/", "title": "9 things you can do with the new Bing search engine with integrated ChatGPT", "paragraph": "Hello! Microsoft’s partnership with OpenAI is starting to bear fruit with this revamped Bing with ChatGPT. Launched just a few days ago and with gradual deployment, the new search engine with artificial intelligence from Redmond is born with the aim of shaking up a segment dominated by Google’s magnifying glass. Recall that this company has shown its new cards with its AI-enhanced version of Bard. But what’s so special about this Bing with ChatGPT? Does it offer anything different from the conversational OpenAI chat that we have already tested in depth? And most interesting: what can you do that you couldn’t do before?"},
{"url": "https://www.osradar.com/an-universal-linux-app-store-app-outlet/", "title": "A universal Linux app store? Try App Outlet", "paragraph": "Until not so long ago, installing applications on one of the Linux distributions was not so easy. Now, thanks to the new graphical interfaces, this is becoming easier and easier. Even the concept of shops has been born, which in Linux have also been implemented. So hot I will introduce you to App Oulet a universal application store for Linux."},
{"url": "https://www.osradar.com/activate-use-iphone-7-8-x-without-sim-card/", "title": "How to activate and use iPhone 7/8/X without a SIM card", "paragraph": "If you just got a new iPhone and wondering about the internal features. But don’t know how to activate and use iPhone without a SIM card to start exploring one of the coolest technology, this article will help you to overcome that challenge. Let’s get started: Activating the iPhone is the most important step in order to make it functional, take photos, enjoy music and videos. To activate your iPhone, a SIM card is essential and has easy methods to complete the process. But if you are planning to use your iPhone without SIM card, or giving away to your kids to use like an iPad, this process will be a little tricky. Below we will show you, How to activate and use iPhone 7/8/X without a SIM card."},
{"url": "https://www.osradar.com/install-wpscan-on-ubuntu-20-04-18-04/", "title": "How to install WPScan on Ubuntu 20.04/ 18.04?", "paragraph": "Security is something that all of us must care about quite a bit. Especially if we have a web site that we manage. And although it is true that, the security aspects of the various applications of a server have been greatly improved, it is also true that cyber thieves have also improved. In this sense, WordPress is one of the most popular CMS that exist today, is very well designed making it a safe option. However, it is convenient that we use tools to verify the possible vulnerabilities that our site may have built with WordPress. Therefore, I will teach you how to install WPScan on Ubuntu 20.04 / 18.04 so that you can use it and make a study on a website made with WordPress and thus know and improve the vulnerabilities."},
{"url": "https://www.osradar.com/ascii-gaming-on-linux/", "title": "ASCII Gaming on Linux!!!", "paragraph": "It’s obvious that all of us enjoy gaming up to a certain extent. Even the nerdiest programmers love to play games. In the case of other everyday users, having no game is like having no life. I play games at my leisure. However, after a hard, stressed working session, nothing is more refreshing than having a relaxed gaming session."},
{"url": "https://www.osradar.com/building-your-own-wireless-access-point-on-top-of-centos7/", "title": "Building your own Wireless Access Point on top of CentOS7", "paragraph": "Wireless is everywhere, though have you ever thought about building your own wireless access point.?Well, if you’ve got capable enough wireless NIC and of course bit of understanding in Linux, that’s what it takes to get the job done.!"},
{"url": "https://www.osradar.com/convert-2d-photos-to-3d-with-these-applications/", "title": "Convert 2D photos to 3D with these applications", "paragraph": "Hi! There are several options when working with 2D and 3D images. Indeed, we have local options as well as online platforms. In this way we can perform all kinds of tasks and work with our personal photos, or with those, we download from the Internet. Certainly, they are fundamental tools for design professionals, amateurs, and students alike. There are many treatments that can be carried out with all this. In fact, we will be able to retouch, even convert, edit, or customize for a specific task. Please remember that this is one of the most used types of content nowadays, both online and locally. Therefore, everything related to photography has been gaining a lot of importance over the years. In this regard, today, we will learn how to convert 2D photos to 3D with these applications. "},
{"url": "https://www.osradar.com/author/roger/", "title": "roger", "paragraph": ""},
{"url": "https://www.osradar.com/android-devices-with-exposed-adb-port/", "title": "Android Devices with Exposed ADB Port", "paragraph": "In the recent days, security has always been one of the greatest concerns of the internet. Now, it’s another vulnerability/flaw in many Android devices that are putting users at risk. The security community raised alarm on the fact that Android devices were having open ADB debug port for remote connection over Wi-Fi."},
{"url": "https://www.osradar.com/customize-folders-with-folder-color-on-linux/", "title": "Customize Folders with Folder Color on Linux", "paragraph": "When you’re working on Linux, there’s obviously tons of directories (folders) you have to work with, right? Even for the most basic users, a good number of folders must be ready to work with. For example, I have to constantly visit the “Movies” folder for watching my movie collection, “Images” for my photos etc."},
{"url": "https://www.osradar.com/deploy-postgresql-using-docker-compose/", "title": "Deploy PostgreSQL using Docker Compose", "paragraph": "As we well know PostgreSQL is one of the most powerful database management systems out there. So many applications will use it for its robustness and processing speed. In addition to other important features. PostgreSQL is also available as a Docker image with all the advantages that this can bring."},
{"url": "https://www.osradar.com/category/applications/", "title": "Applications", "paragraph": ""},
{"url": "https://www.osradar.com/best-microsoft-edge-add-ons-for-viewing-and-editing-photos/", "title": "Best Microsoft Edge add-ons for viewing and editing photos", "paragraph": "Hello! It is becoming more and more common to perform image processing tasks on our computer. Especially among home users. Indeed, the proliferation of good cameras on cell phones means that we take more and more photos. Photos that eventually end up on our PC. Logically, from there, it is easier to view and edit them. For this purpose, it is possible to use certain software programs. However, we can also do this through extensions for our Edge browser. Recall that Microsoft Edge is a browser that has support for the use of add-ons. In fact, Microsoft has already introduced its application store for its browser from where you can install these add-ons. Although it is still in Beta phase, it already has a good catalog of add-ons available. In addition, being based on Chromium makes it compatible with the largest extension store, such as Google’s Chrome Web Store."},
{"url": "https://www.osradar.com/download-microsoft-store-apps-without-an-account/", "title": "Download Microsoft Store apps without an account.", "paragraph": "Hi, how are you? In a previous post, we talked about how convenient it is to use Windows 10 with a local account. Well, a limitation that had this configuration is the inability to download apps from the Microsoft Store. In fact, in this store, you can find hundreds of applications. From productivity to entertainment. Additionally, it has multimedia applications, games, and programs. Some of them are paid and others are free. However, an indispensable requirement to be able to use it is to log in with a Microsoft account. Consequently, this leaves out users with local accounts. But don’t worry, in this post, we will see how to download Microsoft store apps without an account."},
{"url": "https://www.osradar.com/enable-firefox-dark-mode-on-ubuntu/", "title": "Enable Firefox Dark Mode on Ubuntu", "paragraph": "Dark themes, dark modes, dark colors etc. are always some of the coolest and awesome looking ones. In the case of theming, I personally prefer having a really cool-looking dark theme for my system. A little blend of dark and slightly lighter color and you’re looking pretty cool!"},
{"url": "https://www.osradar.com/enable-network-discovery-in-windows-server-2019-2016/?__cf_chl_tk=aNekpjc.B.395PmH4jmXMq0yYmQGkAod4SXQE9YHBcw-1660212183-0-gaNycGzNC30", "title": "Enable network discovery in Windows Server 2019/2016.", "paragraph": "Hi, how are you? Windows Server handles a protocol called Network Discovery. In fact, as its name indicates, it allows you to see or find other computers and network devices. Additionally, it allows other computers on the network to see the server. However, the system may fail to detect other computers on the network. This circumstance is burdensome since it can affect the normal development of the system. Consequently, let’s see how to activate network discovery in Windows Server 2019/2016"},
{"url": "https://www.osradar.com/how-to-access-whatsapp-files-on-android/", "title": "How to access WhatsApp files on Android", "paragraph": "Greetings dear friends, recently WhatsApp incorporated its storage manager to free up space. In it, you can check the space occupied by photos and videos, although this feature does not include all the data saved by the application, such as backups, profile pictures, statuses. Therefore, in this post, we will show you how to access WhatsApp files using a file manager. This way you will have more control over all the data stored by the app on your device."},
{"url": "https://www.osradar.com/how-to-add-queues-and-ring-group-freepbx-16/", "title": "How to add queues and ring Group  Freepbx 16", "paragraph": " Automatic Call Distribution (ACD) or call queuing provides a way for a FreePBX to queue incoming calls. A queue is a stack or line of calls that need to be answered. When a call is directed into the queue, by default, the calls are answered in a first-in, first-out order. Call queues are useful when you have more callers than people available to answer calls. Callers placed into a queue will hear music or advertising until someone is available to answer their call. The Queues module allows you to create and design queues that allow callers to speak with agents as quickly and painlessly as possible "},
{"url": "https://www.osradar.com/how-to-analyze-the-network-with-ip-tools-for-android/", "title": "How to analyze the network with IP Tools for Android", "paragraph": "Hi! If you want to analyze and adjust the network almost professionally, then this post is for you. Indeed, IP Tools is a wonderful suite of utilities to monitor the network. As a result, this Android app allows you to detect network problems and improve network performance. Therefore, it will be very useful for network administrators. On the other hand, IP Tools has a very nice and simple interface that quickly displays the network information. In fact, it is possible to find out the internal or external IP, as well as other configurations. Anyway, let’s see how to analyze the network with IP Tools for Android."},
{"url": "https://www.osradar.com/how-to-backup-and-restore-group-policy-objects-in-windows-server-2016-2019/", "title": "How to backup and restore Group Policy Objects in Windows Server 2016/2019.", "paragraph": "Hi! Previously we have mentioned that Windows Server pursues a centralized administration of each role and service. In this way, a fluid communication between clients and server is guaranteed. To do this, we have a very useful tool, as are the Group Policy Objects. Indeed, this functionality allows to implement specific configurations for the computers within the domain. In addition, these configurations can be both hardware and software. Its importance for the health of the server is then evident. So a smart decision is to keep a back up of these policies. Because if something goes wrong with the system, then the data can be easily restored. So, let’s get to work! Let’s see how to backup and restore Group Policy Objects in Windows Server 2016/2019."},
{"url": "https://www.osradar.com/drone-related-entrepreneurship-and-the-laws-that-govern-the-niche/", "title": "Drone-Related Entrepreneurship and the Laws That Govern the Niche", "paragraph": "The rise of drones has not only transformed the way we perceive the skies but has also paved the way for innovative entrepreneurship. The fusion of cutting-edge drone technology and entrepreneurial spirit has given birth to a dynamic niche – drone-related entrepreneurship."},
{"url": "https://www.osradar.com/how-to-change-the-region-of-your-phone-in-miui-12/", "title": "How to change the Region of your phone in MIUI 12", "paragraph": "Greetings friends, the Android-based mobile operating system MIUI has a feature that allows you to change the Region, by changing the Region it means selecting the country you are in. This way, the system can offer you features and apps that may be more attractive depending on the country you are in. However, not all regions receive the same benefits. For example, to change the system font you must change the Region to India. Also in this Region, it will allow you to use an app store called “MI Picks”. You may even get a little more volume when using headphones due to restrictions in some countries. It may also be useful to receive an OTA update earlier when they are available. In this post, we will show you how to change the Region of your phone in MIUI 12."},
{"url": "https://www.osradar.com/how-to-change-time-zone-in-centos-8-rhel-8/", "title": "How To Change Time Zone in CentOS 8 / RHEL 8", "paragraph": "Time zone can be set while Installing your system but many times you choose the default time zone or the wrong one. In this guide,  you will learn that how you can change the time zone after the Installation of your Operating System. Follow the steps to easily change your time zone on CentOS 8 / RHEL 8"},
{"url": "https://www.osradar.com/how-to-configure-iscsi-target-and-initiator-on-centos-8-rhel-8/", "title": "How To Configure iSCSI Target and Initiator on CentOS 8 /RHEL 8", "paragraph": "Before proceeding further make sure you’ve enough space available for allocation. It is recommended to set a different partition for easier way to manage without interfering with the core CentOS files and system."},
{"url": "https://www.osradar.com/gpu-virtualization-what-is-it-and-what-is-it-used-for/", "title": "GPU virtualization: what is it, and what is it used for?", "paragraph": "As you may already know, virtualization involves a hypervisor running on top of the host machine and utilizing its resources for the virtual machines. Additionally, it’s essential to be aware of GPU virtualization, which may differ from what you initially anticipated.. Here we tell you about it:"},
{"url": "https://www.osradar.com/how-to-configure-storage-server-with-iscsi-in-redhat-and-centos-7/", "title": "How to Configure Storage Server with iSCSI in Redhat and Centos 7", "paragraph": "Let me start with wikipedia definition of  ISCSi . In computing, iSCSI is an acronym for Internet Small Computer Systems Interface, an Internet Protocol (IP)-based storage networking standard for linking data storage facilities. It provides block-level access to storage devices by carrying SCSI commands over a TCP/IP network. iSCSI is used to facilitate data transfers over intranets and to manage storage over long distances. It can be used to transmit data over local area networks (LANs), wide area networks (WANs), or the Internet and can enable location-independent data storage and retrieval."},
{"url": "https://www.osradar.com/how-to-configure-windows-11-to-increase-privacy/", "title": "How to configure Windows 11 to increase privacy", "paragraph": "We are going to explain how to configure Windows 11 to increase your privacy. With this in mind, we will give you a series of tips to do in the configuration. The idea is to use the native tools of the system. Consequently, you will be able to decide which settings you can modify. Of course, this will depend on the degree of privacy you need. Certainly, it is possible that by limiting certain accesses to your information, it is possible that some functions may fail. Therefore, it is crucial to determine to what extent you want to sacrifice features in favor of privacy in Windows 11. Let’s see how to do it"},
{"url": "https://www.osradar.com/how-to-enable-snmp-service-in-windows-10/", "title": "How to enable SNMP service in Windows 10", "paragraph": "Today, we will learn how to enable SNMP service in Windows 10. SNMP stands for Simple Network Management Protocol. Actually, this function facilitates the exchange of management information between network devices. Devices that can support SNMP include routers, switches, servers, workstations, printers, modem racks, among others. SNMP is a component of the Internet Protocol suite. It consists of a set of standards for network management. It also includes a protocol application layer and a schema database. Finally, it also manages a set of data objects."},
{"url": "https://www.osradar.com/how-to-enjoy-electrum-on-linux/", "title": "How to Enjoy Electrum on Linux", "paragraph": "In the case of Bitcoin wallets, there are tons of available options for users. There are also tons of them on Linux platform. Bitcoin wallets are the safest media for enjoying your cryptocurrency. Electrum is one of the most popular Bitcoin wallets out there. We also discussed about Bither and Green Address."},
{"url": "https://www.osradar.com/how-to-create-secret-folders-in-windows-11-step-by-step/", "title": "How to create secret folders in Windows 11 step-by-step", "paragraph": "Hello! Nowadays, people tend to keep an important part of their lives on their computers and even on their cell phones. Consequently, with so many privacy issues, taking care of this information becomes more essential. Fortunately, there is a feature that allows you to keep unwanted eyes away. Therefore, today we are going to learn how to create secret folders in Windows 11."},
{"url": "https://www.osradar.com/how-to-find-appdata/", "title": "How to find AppData", "paragraph": "Hello! Windows has sensitive information for its operation. Indeed, applications and registries are often stored in hidden folders. Which is a logical security measure. This prevents the user from deleting them by mistake. This would cause the system to malfunction. Therefore, Windows keeps these folders hidden by default. For this reason, today we will know how to find the AppData folder."},
{"url": "https://www.osradar.com/how-to-get-the-new-fluent-emojis-in-windows-10/", "title": "How to get the new Fluent emojis in Windows 10", "paragraph": "Hello! It is already well known that Windows 11 has arrived. Therefore, the new Microsoft system has been the first major upgrade in many years. This has been a revolution in many aspects. Mainly in the graphical interface of the system. Well, in mid-July, Microsoft presented some redesigned emojis. Let’s remember that these emojis are based on Fluent Design. In addition, the idea was that they would arrive to new Microsoft products and services. However, Windows 11 arrived on October 4th. Nevertheless, it did not show any new icons. On the other hand, the emojis have been revealed in the Windows Insider Dev Channel. Of course, the channel related to Windows 11. But here we will show you how to use them in any version of Windows 11 or Windows 10. Here, we will show you how to get the new Fluent emojis in Windows 10"},
{"url": "https://www.osradar.com/how-to-check-hard-disk-and-partition-information-in-linux/", "title": "How to Check Hard Disk and Partition Information in Linux", "paragraph": "In this article, we will discus that how to use different commands to see hard disks and the partitions on the Linux server. It is very important that you as a system administrator know about your server hard disk information like its partitions, consumed space and its filesystem."},
{"url": "https://www.osradar.com/how-to-install-chocolatey-in-windows-10/", "title": "How to install Chocolatey in Windows 10", "paragraph": "Hello, how are you? Today we’re going to talk a bit about the package management system. That system, also known as a package manager, is a collection of tools that serve to automate the process of installing, updating, configuring and removing software packages. This term is intimately associated with GNU/Linux systems. Because they rely heavily on package managers. As we mentioned at the beginning, this term is intimately associated with Linux, as it is the main method for installing and uninstalling applications. However, it is possible to install a package manager on Windows. We are talking about Chocolatey. This software management and automation system is based on PowerShell and is able to work with different software installers for Windows systems such as MSI, NSIS, InnoSetup, installation binaries and compressed files (ZIP). Sounds great, doesn’t it? So, we’re going to see how to install and use Chocolatey in Windows 10."},
{"url": "https://www.osradar.com/how-to-install-chrome-os-on-a-virtual-machine/", "title": "How to install Chrome OS on a virtual machine.", "paragraph": "Hi! It is well known that Microsoft has a great market penetration in terms of operating systems. In fact, Windows systems are the most used worldwide. Of course GNU/Linux also offers options. In addition, Apple incorporates macOS in their computers. However, there are other options perhaps not very used, but very interesting. Today we will talk about Chrome OS. This is the operating system developed by Google, based on the Linux kernel and using Chrome as the main user interface. That is, it is a cloud-based operating system. On the other hand, Chrome OS is based on the open source project Chromium OS. Unlike Chrome OS, it can be compiled from downloaded source code. Well, today we will see how to install Chrome OS in a virtual machine."},
{"url": "https://www.osradar.com/how-to-install-docker-ce-on-centos-7/", "title": "How to install Docker CE on CentOS 7?", "paragraph": "Docker is an open source project that automates the deployment of applications within software containers, providing an additional layer of Virtualization abstraction and automation at the operating system level in Linux. The work of system administrators is made easier because the software is implemented in the same way it was tested."},
{"url": "https://www.osradar.com/how-to-install-docker-on-ubuntu-18-04/", "title": "How to install Docker on Ubuntu 18.04?", "paragraph": "It is very likely that you know or have heard about Docker. This wonder that it is a great solution to software deployment problems. However, it is easy to install. This article will show you how to install Docker on Ubuntu 18.04."},
{"url": "https://www.osradar.com/how-to-install-gnome-3-and-kde4-on-freebsd-11/", "title": "How to install  Gnome-3  and KDE4 on FreeBSD 11", "paragraph": "Gnome is one of the most popular desktop Linux environments. Gnome3 is the latest version of this software. In this article, let us look at how to install Gnome 3 on FreeBSD 11.1 and  11.2"},
{"url": "https://www.osradar.com/how-to-install-git-from-the-source-code-on-ubuntu-20-04/", "title": "How to install Git from the source code on Ubuntu 20.04?", "paragraph": "I recently explained how to install Git on Ubuntu 20.04. The two ways I’ve shown you are based on pre-compiled packages for Ubuntu. But sometimes it’s better to do it another way. That’s why, in this post, you’ll learn how to install Git from the source code in Ubuntu 20.04."},
{"url": "https://www.osradar.com/how-to-install-eclipse-ide-on-ubuntu-20-04/", "title": "How To Install Eclipse IDE on Ubuntu 20.04", "paragraph": "In this tutorial, you’ll cover the installation of Eclipse IDE on Ubuntu 20.04. Eclipse IDE is an Integrated Development Environment mostly used for the purpose of programming in Java applications. It provides the most reliable,fast and secure way for programmers to develop their applications  by using Eclipse IDE. So, we’ll cover that how to install Eclipse IDE on Ubuntu 20.04. Just follow the below steps for an easy installation."},
{"url": "https://www.osradar.com/how-to-install-and-use-bash-in-windows-10/", "title": "How to install and use bash in Windows 10", "paragraph": "Hello, how are you? Today we’re going to talk about a computer program well known to Linux users. This is Bash. It’s a POSIX-compatible Unix shell and the default shell on most GNU/Linux distributions, plus macOS. In addition, it is a computer program, whose function is to interpret commands and a console language. As mentioned, it is an essential tool for Linux users, but not so much for Windows users. However, for some time now Microsoft has been interested in the possibilities offered by free software. Specifically, since 2016, the company announced the development of the Windows Subsystem for Linux (WSL). This was later included in the operating system as an update, also Ubuntu appeared as a downloadable program in the Microsoft Store. An interesting innovation without a doubt, for that reason I will show you how to install and use Bash on Windows."},
{"url": "https://www.osradar.com/how-to-install-hbase-on-ubuntu-18-04/", "title": "How To Install HBase on Ubuntu 18.04", "paragraph": "HRegion server stores the data into StoreFiles as directed by the HMaster while HMaster server controls the HBase cluster.Both servers can be started & stopped using the scripts local-master-backup.sh and local-regionserver.sh respectively."},
{"url": "https://www.osradar.com/how-to-install-i-doit-asset-management-tool-on-ubuntu-18-04/", "title": "How To Install i-doit Asset Management Tool on Ubuntu 18.04", "paragraph": "Today we are going to Install i-doit tool on our Ubuntu 18.04. It has various features due to which we prefer it in our IT system. i-doit is Professional IT documentaion & CMDB tool that provides the way to manage the entire IT system. "},
{"url": "https://www.osradar.com/how-to-enable-and-disable-ping-icmp-in-windows-10-firewall/", "title": "How to enable and disable PING ICMP in Windows 10 Firewall", "paragraph": "Hello! This time I’m going to talk to you about security in Windows 10. It is well known that the system offers multiple layers of security to keep the privacy of our information safe. Certainly, this entails control over network connections. These are really useful for exchanging information and sending data. However, sometimes these connections can fail and so it is imperative to get the error. One of the resources used for this task is PING. It is a basic Internet program that allows a user to verify that a particular IP address exists and can accept requests. This app verifies whether the IP address of a host is currently operational, and how long it takes to respond. Ping works by sending an Internet Control Message Protocol (ICMP) Echo Request to a specified interface on the network and waiting for a reply. "},
{"url": "https://www.osradar.com/how-to-install-google-chrome-on-linux/", "title": "How to Install Google Chrome on Linux", "paragraph": "Google Chrome is one of the most popular web browsers for all platforms. It offers faster performance and very stable with lots of advanced functions to work with. For everyday users, Chrome is really suitable for having the title of the prime web browser of the internet. Thankfully, it’s available on all the major platforms."}
]